{
  "backend/main.mo": "Defines the backend actor with access control, user profiles, app data storage, and data models for dates, payments, monetary events, travel entries, travellers, and incomes.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature requests to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains pre-written summaries of multiple frontend source files for reference or documentation.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend styles.",
  "frontend/index.html": "HTML entry point defining the root element and loading the main frontend script.",
  "frontend/src/App.tsx": "Main app component that handles authentication state and conditionally displays profile setup or the ledger page.",
  "frontend/src/components/AppHeader.tsx": "Header showing branding, sync status, and logout controls with cache and storage clearing.",
  "frontend/src/components/AuthGate.tsx": "Authentication wrapper that displays a login screen until an Internet Identity session is active.",
  "frontend/src/components/EmptyState.tsx": "Reusable component that displays an icon or illustration with title, description, and optional action button.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting first-time users to enter and save their name with validation and toast feedback.",
  "frontend/src/components/ResponsiveTableShell.tsx": "Wrapper adding horizontal scroll support for table content using a ScrollArea.",
  "frontend/src/components/SyncStatusIndicator.tsx": "Visual indicator showing sync, success, or failure states with optional time‑ago display.",
  "frontend/src/features/ledger/BackupRestorePanel.tsx": "UI panel to export ledger state to a JSON backup and restore data with confirmation when drafts exist.",
  "frontend/src/features/ledger/CarExpensesPanel.tsx": "Manages car expense entry, auto-toll settings, and computes category totals within a date range.",
  "frontend/src/features/ledger/CashPaymentForm.tsx": "Dialog form for adding a cash payment for a traveller with validation and toast feedback.",
  "frontend/src/features/ledger/ClearDataPanel.tsx": "Password‑protected panel allowing selective or full clearing of ledger data with confirmation dialogs.",
  "frontend/src/features/ledger/CoTravellerIncomeDialog.tsx": "Dialog for adding or editing other co‑traveller income entries with date, amount, and note fields.",
  "frontend/src/features/ledger/DailyParticipationGrid.tsx": "Renders a grid for marking daily AM/PM trips per traveller, with weekend inclusion toggles and save actions.",
  "frontend/src/features/ledger/DateRangePicker.tsx": "Provides a date-range selector using popover calendars, supporting controlled or context-driven state.",
  "frontend/src/features/ledger/DeleteCarExpenseAlertDialog.tsx": "Confirmation dialog for deleting a car expense and showing a toast on success.",
  "frontend/src/features/ledger/DeleteCashPaymentAlertDialog.tsx": "Confirmation dialog for deleting a traveller's cash payment with success toast.",
  "frontend/src/features/ledger/DeleteTripHistoryEntryAlertDialog.tsx": "Dialog confirming deletion of a trip history entry, optionally clearing AM/PM data for travellers.",
  "frontend/src/features/ledger/EditCarExpenseDialog.tsx": "Form dialog to edit car expense details with validation and update callbacks.",
  "frontend/src/features/ledger/EditCashPaymentDialog.tsx": "Form dialog to edit a cash payment's amount, date, and note with validation.",
  "frontend/src/features/ledger/EditTripHistoryTravellerDialog.tsx": "Dialog allowing AM/PM trip toggles for a traveller on a specific date with update handling.",
  "frontend/src/features/ledger/ExpenseHistoryDialog.tsx": "Dialog wrapper displaying the expense history view for the selected date range.",
  "frontend/src/features/ledger/ExpenseHistoryView.tsx": "Displays and filters car expenses by date, category, and search, with options to edit or delete entries.",
  "frontend/src/features/ledger/ExportButton.tsx": "Provides a button that opens the report export dialog.",
  "frontend/src/features/ledger/ExportReportDialog.tsx": "Dialog for exporting ledger reports with selectable formats, report types, and detailed filter options.",
  "frontend/src/features/ledger/LedgerPage.tsx": "Main ledger page managing tabs, dialogs, date ranges, and syncing while rendering all major ledger panels.",
  "frontend/src/features/ledger/LedgerStateContext.tsx": "Context wrapper exposing ledger state and mutation functions from useLedgerLocalState.",
  "frontend/src/features/ledger/MobileLedgerSidebarNav.tsx": "Mobile sidebar menu for navigating ledger tabs and opening payment, expense, and export dialogs.",
  "frontend/src/features/ledger/OtherPendingAmountForm.tsx": "Dialog form to add a new 'other pending' amount for a traveller with validation and submission handling.",
  "frontend/src/features/ledger/OverallMonthYearSelector.tsx": "Month/year selector that derives range classification and updates ledger date range accordingly.",
  "frontend/src/features/ledger/OverallSummaryPanel.tsx": "Displays total income, expenses, profit/loss, and monthly breakdown computed from daily data and car expenses.",
  "frontend/src/features/ledger/PaymentHistoryDialog.tsx": "Dialog wrapper that shows the payment history view within a scrollable modal.",
  "frontend/src/features/ledger/PaymentHistoryView.tsx": "Shows filtered cash payments with traveller filter, table display, and edit/delete controls.",
  "frontend/src/features/ledger/PaymentSummaryPanel.tsx": "Computes per-traveller dues, payments, and balances along with co-traveller income totals for the selected range.",
  "frontend/src/features/ledger/RatePerTripControl.tsx": "Input control for updating the trip rate with validation and formatted display.",
  "frontend/src/features/ledger/SummaryPanel.tsx": "Generates per-traveller weekday/weekend trip counts, charges, payments, and balances with forms for adding payments and pending amounts.",
  "frontend/src/features/ledger/TravellerManager.tsx": "UI component to add, rename, and remove travellers, blocking deletion if they have outstanding balances. Uses ledger state and balance calculations to manage the traveller list.",
  "frontend/src/features/ledger/TripHistoryPanel.tsx": "Builds and displays trip history entries for travellers and co-travellers within a date range, with editing and deletion dialogs. Computes totals and handles sorting and filtering logic.",
  "frontend/src/features/ledger/TripsPaymentYearSelector.tsx": "Dropdown component allowing users to pick a year from a generated range for trip payment views. Triggers a callback when the selected year changes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, auto-refreshing dependent queries when the actor changes. Supports anonymous and authenticated modes with access initialization.",
  "frontend/src/hooks/useAppDataSync.ts": "Synchronizes local ledger state with remote backend data using polling and debounced saves, merging changes safely and tracking sync status. Manages versioning, hashing, and conflict resolution.",
  "frontend/src/hooks/useAutoTollSettings.ts": "Manages auto-toll configuration stored in localStorage, allowing toggling and updating of the toll amount. Persists settings automatically on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, loading stored identities and handling login/logout flows. Wraps AuthClient with custom initialization and exposes identity status flags.",
  "frontend/src/hooks/useLedgerLocalState.ts": "Manages local ledger state with React hooks, including travellers, trips, payments, expenses, and persistence to localStorage.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and saving the current user's profile via an actor.",
  "frontend/src/index.css": "Defines Tailwind CSS variables, themes, and base styling including tables and background colors.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/utils/accountingStatements.ts": "Generates monthly income/expense reports and profit/loss calculations from ledger data.",
  "frontend/src/utils/backupRestore.ts": "Handles exporting, importing, validating, and merging backup JSON for ledger state.",
  "frontend/src/utils/dateRange.ts": "Provides date utilities for ranges, formatting, weekdays, and classifying month/year spans.",
  "frontend/src/utils/exportExcel.ts": "Exports ledger data to CSV files including daily grids and summary calculations.",
  "frontend/src/utils/exportPdf.ts": "Routes export requests to various PDF generators and builds an HTML-based standard report with traveller filtering and date-driven summaries.",
  "frontend/src/utils/exportReport.ts": "Generates CSV exports for ledger data using filters, building daily grids, summaries, and metadata before triggering download.",
  "frontend/src/utils/ledgerBalances.ts": "Computes a traveller’s trip count, charges, payments, and balance within a date range, including optional pending amounts.",
  "frontend/src/utils/money.ts": "Provides INR currency formatting and parsing helpers.",
  "frontend/src/utils/tripCalculations.ts": "Calculates total and monthly income based on trip data and weekend rules, including co-traveller income adjustments.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters with sessionStorage support and hash-route compatibility.",
  "frontend/src/utils/weekendInclusion.ts": "Determines whether dates, including weekends, should be included or editable based on settings and saved trip data.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom fonts, color variables, layout settings, animations, and typography/container-query/animate plugins.",
  "project_state.json": "Defines project state for date‑range filtering features, tracking requirements, new feature requests, and architectural notes for Carpool Ledger."
}