{
  "backend/main.mo": "Motoko canister managing access control, user profiles, balances, and monetary events with admin/user permissions and charge creation logic.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing functionality of various frontend files including components, hooks, and utilities.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app component orchestrating auth flow, profile setup, and ledger rendering with initialization loading states.",
  "frontend/src/backend.idl.ts": "Candid IDL definitions for the backend canister, exposing profile, role, balance, and charge-related methods.",
  "frontend/src/components/AppHeader.tsx": "Header component showing app branding and a user menu with logout.",
  "frontend/src/components/AuthGate.tsx": "Authentication wrapper showing login UI or initialization loader before rendering protected content.",
  "frontend/src/components/EmptyState.tsx": "Reusable component for displaying empty states with optional icon, illustration, and action button.",
  "frontend/src/components/InitLoadingScreen.tsx": "Branded loading screen shown during initialization phases with skeleton placeholders.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal that collects a user's name and saves their profile via a mutation, with validation and toast feedback.",
  "frontend/src/components/ResponsiveTableShell.tsx": "Wrapper providing a horizontally scrollable area for tables using a ScrollArea and ScrollBar.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "Error boundary class that catches runtime render errors and shows a fallback UI while logging details.",
  "frontend/src/components/RuntimeErrorFallback.tsx": "UI fallback card displaying an error message and reload button when a runtime error occurs.",
  "frontend/src/features/ledger/CarExpensesPanel.tsx": "Panel for adding and viewing car expenses, validating inputs, auto-filling tolls, and computing totals by date range.",
  "frontend/src/features/ledger/CashPaymentForm.tsx": "Dialog form for recording a traveller's cash payment with validation, date selection, and toast feedback.",
  "frontend/src/features/ledger/DailyParticipationGrid.tsx": "Grid for marking travellers' morning/evening trips, supporting bulk actions, weekend inclusion, and saving draft data.",
  "frontend/src/features/ledger/DateRangePicker.tsx": "Popover-based picker allowing users to adjust the ledger’s start and end dates with calendar inputs.",
  "frontend/src/features/ledger/DeleteCarExpenseAlertDialog.tsx": "Confirmation dialog for deleting a car expense, triggering a toast and callback on confirm.",
  "frontend/src/features/ledger/DeleteCashPaymentAlertDialog.tsx": "Confirmation dialog for deleting a cash payment, calling a delete handler and showing a toast on success.",
  "frontend/src/features/ledger/EditCarExpenseDialog.tsx": "Dialog component for editing a car expense with validation and category handling.",
  "frontend/src/features/ledger/EditCashPaymentDialog.tsx": "Dialog for editing a cash payment, validating inputs, and submitting updates.",
  "frontend/src/features/ledger/ExpenseHistoryDialog.tsx": "Opens a dialog showing the ExpenseHistoryView for browsing past car expenses.",
  "frontend/src/features/ledger/ExpenseHistoryView.tsx": "Displays car expenses with filters, search, and edit/delete actions.",
  "frontend/src/features/ledger/ExportButton.tsx": "Button that opens the export report dialog.",
  "frontend/src/features/ledger/ExportReportDialog.tsx": "Dialog for exporting ledger data with format options and section/traveller filters.",
  "frontend/src/features/ledger/LedgerPage.tsx": "Main ledger page combining tabs, controls, dialogs, and unsaved-change handling.",
  "frontend/src/features/ledger/LedgerStateContext.tsx": "Context provider exposing ledger state and mutation functions from local state hooks.",
  "frontend/src/features/ledger/OtherPendingAmountForm.tsx": "Form dialog allowing users to add a new 'other pending' amount for a traveller with validation and toast notification.",
  "frontend/src/features/ledger/OverallSummaryPanel.tsx": "Shows overall income, expenses, and monthly breakdown using daily data and date‑filtered car expenses.",
  "frontend/src/features/ledger/PaymentHistoryDialog.tsx": "Dialog wrapper that opens a scrollable view of all cash payments within the selected date range.",
  "frontend/src/features/ledger/PaymentHistoryView.tsx": "Displays cash payment history with traveller filter, editable entries, and date‑range filtering in a table.",
  "frontend/src/features/ledger/RatePerTripControl.tsx": "Input control for adjusting the per‑trip rate with validation and synced ledger state updates.",
  "frontend/src/features/ledger/SummaryPanel.tsx": "Per‑traveller balance summary showing trips, charges, payments, pending amounts, and actions to add new entries.",
  "frontend/src/features/ledger/TravellerManager.tsx": "Manages traveller list with add, rename, and conditional delete based on balance, using ledger state utilities.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including login, logout, and stored identity loading.",
  "frontend/src/hooks/useLedgerLocalState.ts": "Manages local ledger state with travellers, trip data, payments, expenses, and persistence to localStorage.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and saving the caller's user profile using the authenticated actor.",
  "frontend/src/index.css": "Tailwind base styles with custom CSS variables for light/dark themes and improved table readability.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/utils/dateRange.ts": "Utilities for generating date ranges and formatting dates for keys and display.",
  "frontend/src/utils/exportExcel.ts": "Builds CSV-based Excel exports of trip grids and summary calculations from ledger state.",
  "frontend/src/utils/exportReport.ts": "Generates customizable CSV reports including grids, summaries, payments, and expenses with filters.",
  "frontend/src/utils/money.ts": "Formats and parses INR currency values.",
  "frontend/src/utils/travellerBalance.ts": "Computes a traveller's trip count, charges, payments, pending amounts, and final balance within a date range.",
  "frontend/src/utils/tripCalculations.ts": "Calculates total and monthly income from daily trip data within a date range, respecting weekend inclusion rules.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/utils/weekendInclusion.ts": "Determines whether a date is a weekend and whether it should be included or editable based on Saturday/Sunday flags.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with extended theme settings, plugins, and custom animations.",
  "project_state.json": "Project metadata describing current state, issues, and features related to fixing a black-screen load problem and improving runtime safety."
}