{
  "backend/main.mo": "Defines data types and maps for users, travellers, trips, and payments, and provides profile and app‑data save/fetch functions with access control.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to related frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend source files for reference.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend styles.",
  "frontend/index.html": "HTML entry point that loads the root React app through main.tsx.",
  "frontend/src/App.tsx": "Main React component handling authentication, profile setup gating, theming, and rendering the ledger page.",
  "frontend/src/components/AppHeader.tsx": "Header showing branding, sync status, and logout controls with cache and identity clearing.",
  "frontend/src/components/AuthGate.tsx": "Wrapper that enforces Internet Identity login before rendering app content.",
  "frontend/src/components/EmptyState.tsx": "Generic empty‑state UI component with optional icon, illustration, and action button.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for first‑time users to enter and save their name, preventing dismissal until completed.",
  "frontend/src/components/ResponsiveTableShell.tsx": "Provides horizontal scroll wrapping for table content on smaller screens.",
  "frontend/src/components/SyncStatusIndicator.tsx": "Displays syncing, synced, or failed status with icons and last‑sync time.",
  "frontend/src/features/ledger/BackupRestorePanel.tsx": "Provides UI to export ledger state to a JSON backup and restore it with confirmation when unsaved changes exist. Handles file import, merge restore, and status toasts.",
  "frontend/src/features/ledger/CarExpensesPanel.tsx": "Manages car expense entry with categories, auto-toll settings, validation, and displays totals for the selected date range. Includes a dialog for adding expenses and syncing toll settings.",
  "frontend/src/features/ledger/CashPaymentForm.tsx": "Dialog form for adding a traveller's cash payment with validation, date selection, notes, and submission callback. Resets state and shows success toasts after submitting.",
  "frontend/src/features/ledger/ClearDataPanel.tsx": "Protected admin panel requiring a password to unlock various data‑clearing actions (all data, daily data, payments, pending amounts, car expenses). Each action uses confirmation dialogs and triggers state‑clearing functions with toasts.",
  "frontend/src/features/ledger/CoTravellerIncomeDialog.tsx": "Dialog for adding or editing co‑traveller income entries with amount, date, and note fields. Handles validation, state resets, and calls ledger state actions for create/update.",
  "frontend/src/features/ledger/DailyParticipationGrid.tsx": "Renders a daily trip participation grid with bulk toggles, weekend settings, and save actions using ledger state.",
  "frontend/src/features/ledger/DateRangePicker.tsx": "Provides a date‑range selector using popover calendars, supporting controlled or context-driven updates.",
  "frontend/src/features/ledger/DeleteCarExpenseAlertDialog.tsx": "Displays a confirmation dialog for deleting a car expense and triggers a toast on success.",
  "frontend/src/features/ledger/DeleteCashPaymentAlertDialog.tsx": "Shows a confirmation dialog for deleting a cash payment tied to a traveller and notifies on success.",
  "frontend/src/features/ledger/DeleteTripHistoryEntryAlertDialog.tsx": "Confirmation dialog for deleting a trip history entry, with additional warning for traveller entries.",
  "frontend/src/features/ledger/EditCarExpenseDialog.tsx": "Dialog for editing a car expense with form validation and update submission.",
  "frontend/src/features/ledger/EditCashPaymentDialog.tsx": "Dialog allowing edits to a cash payment’s amount, date, and note, with validation and toast feedback.",
  "frontend/src/features/ledger/EditTripHistoryTravellerDialog.tsx": "Form dialog to update a traveller’s morning/evening trip participation for a specific date.",
  "frontend/src/features/ledger/ExpenseHistoryDialog.tsx": "Wraps the expense history view inside a dialog for browsing expense records.",
  "frontend/src/features/ledger/ExpenseHistoryView.tsx": "Displays, filters, sorts, and manages car expense records with edit and delete dialogs.",
  "frontend/src/features/ledger/ExportButton.tsx": "Shows an Export button that opens the export report dialog.",
  "frontend/src/features/ledger/ExportReportDialog.tsx": "Dialog for exporting ledger reports with format, type, and filter options, triggering PDF or CSV export.",
  "frontend/src/features/ledger/LedgerPage.tsx": "Main ledger page managing tabs, dialogs, date ranges, and overall UI structure.",
  "frontend/src/features/ledger/LedgerStateContext.tsx": "Provides global ledger state and actions via React context using local state hooks.",
  "frontend/src/features/ledger/MobileLedgerSidebarNav.tsx": "Mobile sidebar navigation for switching tabs and opening history or export dialogs.",
  "frontend/src/features/ledger/OtherPendingAmountForm.tsx": "Form dialog to add a new 'other pending' amount for a traveller with validation.",
  "frontend/src/features/ledger/OverallSummaryPanel.tsx": "Computes total income, expenses, profit/loss, and monthly breakdowns from ledger data and renders a summary UI.",
  "frontend/src/features/ledger/PaymentHistoryDialog.tsx": "Dialog wrapper that displays the payment history view with scrollable content.",
  "frontend/src/features/ledger/PaymentHistoryView.tsx": "Filters, sorts, and displays cash payments with traveller filtering and edit/delete actions.",
  "frontend/src/features/ledger/PaymentSummaryPanel.tsx": "Generates per‑traveller payment/charge summaries and overall totals for the selected date range.",
  "frontend/src/features/ledger/RatePerTripControl.tsx": "Provides an input control for viewing and updating the rate charged per trip.",
  "frontend/src/features/ledger/SummaryPanel.tsx": "Computes per‑traveller trip counts, charges, payments, and balances and displays detailed summaries with forms for adding payments.",
  "frontend/src/features/ledger/TravellerManager.tsx": "Allows adding, renaming, and removing travellers, blocking deletion when balances are unsettled.",
  "frontend/src/features/ledger/TripHistoryPanel.tsx": "Builds and displays a sorted list of traveller and co‑traveller trip entries with totals and edit/delete dialogs. Pulls data from ledger state and prepares per‑day trip records within the selected date range.",
  "frontend/src/features/ledger/TripsPaymentYearSelector.tsx": "Renders a dropdown to pick a year within a predefined range and notifies the parent of changes. Uses a calendar icon and UI select components.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, initializing access control when authenticated. Invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAppDataSync.ts": "Continuously syncs local ledger state with remote backend data, merging on changes and handling polling, debouncing, and version tracking. Provides sync status and error handling.",
  "frontend/src/hooks/useAutoTollSettings.ts": "Manages auto‑toll settings stored in localStorage with persistent enable/amount fields. Exposes helpers to update and save the settings.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an authentication context using Internet Identity, handling login, stored identity restoration, and status tracking. Wraps AuthClient setup and exposes login and clear functions.",
  "frontend/src/hooks/useLedgerLocalState.ts": "Maintains all local ledger data including travellers, trips, payments, expenses, date ranges, and settings, with load/save logic backed by localStorage. Provides helpers for generating IDs, cloning data, and merging stored state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to fetch and save the caller’s user profile via the backend actor. Handles loading states and invalidates profile queries on save.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light and dark themes, plus global styles and table formatting.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, importing global styles.",
  "frontend/src/utils/accountingStatements.ts": "Provides functions to generate monthly, profit/loss, income, and expense statements from ledger data.",
  "frontend/src/utils/backupRestore.ts": "Implements backup export/import, validation, and merging logic for ledger state.",
  "frontend/src/utils/dateRange.ts": "Utility functions for generating date ranges, formatting dates, and filtering weekdays.",
  "frontend/src/utils/exportExcel.ts": "Builds CSV-based Excel exports including daily grids and summary calculations for travellers.",
  "frontend/src/utils/exportPdf.ts": "Generates various PDF reports based on ledger data and selected report type.",
  "frontend/src/utils/exportReport.ts": "Generates CSV and PDF carpool ledger reports based on filters, traveller data, daily participation, payments, and expenses.",
  "frontend/src/utils/ledgerBalances.ts": "Computes per-traveller trips, charges, payments, pending amounts, and final balance within a date range.",
  "frontend/src/utils/money.ts": "Provides helpers to format and parse INR currency values.",
  "frontend/src/utils/tripCalculations.ts": "Calculates total and monthly income from trip data, including co-traveller income and weekend handling.",
  "frontend/src/utils/urlParams.ts": "Manages URL and session-stored parameters, supporting hash-based routing and persistence.",
  "frontend/src/utils/weekendInclusion.ts": "Determines whether weekend dates should be included or editable based on settings and saved trip data.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, fonts, animations, and plugins for the project.",
  "project_state.json": "Describes project metadata, features, requirements, and current state for the Carpool Ledger app."
}