{
  "backend/main.mo": "Defines core actor with authorization mixin, user profile storage, app data management, and typed modules for dates, payments, events, travellers, and incomes.",
  "feature_evidence.json": "Lists feature evidence records mapping feature requirements to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for major frontend files including components, hooks, utilities, and styling.",
  "frontend/index.css": "Empty stylesheet placeholder.",
  "frontend/index.html": "Base HTML file that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main app component handling authentication gating, profile setup prompt, and rendering the LedgerPage with theme and toast providers.",
  "frontend/src/components/AppHeader.tsx": "Header with branding, sync indicator, user menu, and logout logic that clears query cache and local storage.",
  "frontend/src/components/AuthGate.tsx": "Auth wrapper that shows login card when unauthenticated and renders children when logged in.",
  "frontend/src/components/EmptyState.tsx": "Reusable empty-state display with optional icon or illustration and an action button.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal requiring users to enter and save their name before accessing the app, preventing outside or escape dismissal.",
  "frontend/src/components/ResponsiveTableShell.tsx": "Wrapper providing horizontal scroll for wide tables using ScrollArea and ScrollBar.",
  "frontend/src/components/SyncStatusIndicator.tsx": "Displays sync status with an icon, label, and optional last-sync time indicator.",
  "frontend/src/features/ledger/BackupRestorePanel.tsx": "Provides UI to export ledger data to a file and restore backups with confirmation flows and merge behavior.",
  "frontend/src/features/ledger/CarExpensesPanel.tsx": "Manages car expenses, including manual entry, auto-toll generation, validation, and category handling.",
  "frontend/src/features/ledger/CashPaymentForm.tsx": "Dialog form for recording a traveller's cash payment with validation and submission callbacks.",
  "frontend/src/features/ledger/ClearDataPanel.tsx": "Protected panel allowing selective or full clearing of ledger data with password unlock and confirmation dialogs.",
  "frontend/src/features/ledger/CoTravellerIncomeDialog.tsx": "Dialog to record other co-traveller income with amount/date inputs and submission handling.",
  "frontend/src/features/ledger/DailyParticipationGrid.tsx": "Renders a grid for marking daily AM/PM trips per traveller with weekend controls and save actions.",
  "frontend/src/features/ledger/DateRangePicker.tsx": "Provides two popover calendar pickers to set the ledger’s start and end dates.",
  "frontend/src/features/ledger/DeleteCarExpenseAlertDialog.tsx": "Confirmation dialog for deleting a car expense and showing a success toast.",
  "frontend/src/features/ledger/DeleteCashPaymentAlertDialog.tsx": "Confirmation dialog for deleting a cash payment with a success toast.",
  "frontend/src/features/ledger/EditCarExpenseDialog.tsx": "Dialog allowing users to edit car expense fields with validation and update callbacks.",
  "frontend/src/features/ledger/EditCashPaymentDialog.tsx": "Dialog for editing a cash payment’s amount, date, and note with validation.",
  "frontend/src/features/ledger/ExpenseHistoryDialog.tsx": "Wrapper dialog displaying the expense history view within a scrollable content area.",
  "frontend/src/features/ledger/ExpenseHistoryView.tsx": "Lists, filters, and manages car expenses by date range, category, and search with edit/delete options.",
  "frontend/src/features/ledger/ExportButton.tsx": "Button that opens a dialog for exporting a report.",
  "frontend/src/features/ledger/ExportReportDialog.tsx": "Dialog for exporting ledger reports with selectable formats and filter options.",
  "frontend/src/features/ledger/LedgerPage.tsx": "Main ledger page managing tabs, dialogs, syncing, and overall UI layout.",
  "frontend/src/features/ledger/LedgerStateContext.tsx": "Context provider exposing ledger state, actions, and persistence helpers.",
  "frontend/src/features/ledger/MobileLedgerSidebarNav.tsx": "Mobile sidebar navigation for switching ledger tabs and opening history or export dialogs.",
  "frontend/src/features/ledger/OtherPendingAmountForm.tsx": "Form dialog for adding a traveller’s additional pending amount with validation.",
  "frontend/src/features/ledger/OverallSummaryPanel.tsx": "Panel showing total income, expenses, and profit/loss plus monthly breakdowns.",
  "frontend/src/features/ledger/PaymentHistoryDialog.tsx": "Dialog wrapper displaying the payment history view.",
  "frontend/src/features/ledger/PaymentHistoryView.tsx": "Displays and filters cash payments by traveller and date range, and provides edit/delete actions. Renders a table or empty state accordingly.",
  "frontend/src/features/ledger/RatePerTripControl.tsx": "Controls the per‑trip rate with validation and sync to ledger state. Shows an input field with formatted currency.",
  "frontend/src/features/ledger/SummaryPanel.tsx": "Computes per‑traveller trip counts, charges, payments, and balances for the date range and displays them in a summary card. Includes forms for adding payments and other pending amounts.",
  "frontend/src/features/ledger/TravellerManager.tsx": "Manages adding, renaming, and removing travellers, blocking deletion if balance is non‑zero. Renders traveller list with inline editing.",
  "frontend/src/hooks/useActor.ts": "Initializes and caches a backend actor based on Internet Identity, handling access control and invalidating dependent queries on change.",
  "frontend/src/hooks/useAppDataSync.ts": "Continuously syncs local ledger state with the backend using polling, merge logic, and debounced saves. Tracks sync status and handles conflict resolution.",
  "frontend/src/hooks/useAutoTollSettings.ts": "Stores and retrieves auto‑toll settings from localStorage with validation. Provides setters to update enabled state and amount.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, and persisted identity handling.",
  "frontend/src/hooks/useLedgerLocalState.ts": "Implements local ledger state management with persistence, including travellers, trips, payments, expenses, and date ranges.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend profile fetch and save calls with React Query hooks for user profile data.",
  "frontend/src/index.css": "Defines Tailwind-based global styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and Internet Identity providers.",
  "frontend/src/utils/backupRestore.ts": "Handles exporting, importing, validating, and merging local ledger backup data.",
  "frontend/src/utils/dateRange.ts": "Provides date utilities for formatting and generating weekday ranges.",
  "frontend/src/utils/exportExcel.ts": "Generates CSV exports of ledger data including daily grids and summary calculations.",
  "frontend/src/utils/exportReport.ts": "Generates CSV export sections for daily grids and summaries based on ledger state and filters, including trip, payment, and expense calculations. Handles CSV formatting, file download, balance coloring, and traveller filtering.",
  "frontend/src/utils/ledgerBalances.ts": "Computes a traveller’s balance for a date range by summing trip charges and pending amounts minus payments, respecting weekend inclusion rules. Filters and totals relevant ledger entries within the range.",
  "frontend/src/utils/money.ts": "Provides helpers to format INR currency and parse numeric values from currency strings. Wraps Intl.NumberFormat for consistent currency output.",
  "frontend/src/utils/tripCalculations.ts": "Calculates income totals and monthly breakdowns from trip data and optional co‑traveller income within a date range, respecting weekend inclusion. Iterates through dailyData to sum trip-based earnings.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash segments, and sessionStorage. Supports extracting and maintaining parameters across navigation.",
  "frontend/src/utils/weekendInclusion.ts": "Determines whether a date is a weekend day and whether it should be included or editable based on Saturday/Sunday flags. Provides simple weekend inclusion logic for trip calculations.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining theme extensions, colors, fonts, animations, and plugins like typography and container queries. Sets global design tokens and utility behavior for the UI.",
  "project_state.json": "Describes project requirements and state for implementing default Mon–Fri date ranges and an Auto Toll feature in car expenses. Tracks feature versions, pending requests, and architectural notes."
}