{
  "backend/main.mo": "Motoko canister defining access-controlled ledger data types, user profiles, balances, and charge creation logic with date-based entries.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing their purpose and behavior.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend styles.",
  "frontend/index.html": "HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Root app component handling authentication, profile setup, theme, and rendering the ledger page.",
  "frontend/src/components/AppHeader.tsx": "Header with branding and user menu supporting logout and profile identity display.",
  "frontend/src/components/AuthGate.tsx": "Authentication guard that shows a login screen until the user is authenticated.",
  "frontend/src/components/EmptyState.tsx": "Reusable empty-state component displaying an icon or illustration with text and optional action.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter and save their name, with validation and submission handling.",
  "frontend/src/components/ResponsiveTableShell.tsx": "Wrapper providing horizontal scroll support for wide tables using ScrollArea.",
  "frontend/src/features/ledger/CarExpensesPanel.tsx": "Displays car expenses for a date range, computes totals, and provides a dialog to add categorized car expenses.",
  "frontend/src/features/ledger/CashPaymentForm.tsx": "Form dialog for recording a traveller’s cash payment with amount, date, and note validation.",
  "frontend/src/features/ledger/DailyParticipationGrid.tsx": "Grid UI to mark travellers’ AM/PM trips per day, manage weekend inclusion, and save daily participation data.",
  "frontend/src/features/ledger/DateRangePicker.tsx": "Popover-based picker allowing users to set start and end dates for the ledger’s active date range.",
  "frontend/src/features/ledger/DeleteCarExpenseAlertDialog.tsx": "Confirmation dialog for deleting a car expense with a success toast on completion.",
  "frontend/src/features/ledger/DeleteCashPaymentAlertDialog.tsx": "Confirmation dialog for deleting a cash payment tied to a traveller, with success feedback.",
  "frontend/src/features/ledger/EditCarExpenseDialog.tsx": "Dialog for editing an existing car expense with validation and update callbacks.",
  "frontend/src/features/ledger/EditCashPaymentDialog.tsx": "Dialog for editing a cash payment with validation and update callbacks.",
  "frontend/src/features/ledger/ExpenseHistoryDialog.tsx": "Wrapper dialog that opens and displays the expense history view.",
  "frontend/src/features/ledger/ExpenseHistoryView.tsx": "Displays filterable, searchable, and sortable car expense history with edit/delete actions.",
  "frontend/src/features/ledger/ExportButton.tsx": "Button that opens the export report dialog.",
  "frontend/src/features/ledger/ExportReportDialog.tsx": "Dialog for exporting ledger data with format selection and section/traveller filters.",
  "frontend/src/features/ledger/LedgerPage.tsx": "Main ledger page with tabs, date controls, summaries, expenses, and history dialogs.",
  "frontend/src/features/ledger/LedgerStateContext.tsx": "Context provider exposing ledger state and mutation functions from local state hooks.",
  "frontend/src/features/ledger/OtherPendingAmountForm.tsx": "Dialog form for adding other pending amounts for a traveller with validation.",
  "frontend/src/features/ledger/OverallSummaryPanel.tsx": "Computes total and month-wise income, expenses, and profit/loss for all travellers within a date range and renders an overall financial summary.",
  "frontend/src/features/ledger/PaymentHistoryDialog.tsx": "Provides a dialog that displays the payment history view, triggered by a button.",
  "frontend/src/features/ledger/PaymentHistoryView.tsx": "Filters and displays cash payments in a sortable table with options to edit or delete entries.",
  "frontend/src/features/ledger/RatePerTripControl.tsx": "Allows editing the per-trip rate with validation and syncs changes to ledger state.",
  "frontend/src/features/ledger/SummaryPanel.tsx": "Calculates per-traveller trip counts, charges, payments, pending amounts, and balances for the selected date range and displays detailed summaries.",
  "frontend/src/features/ledger/TravellerManager.tsx": "Manages traveller records, allowing adding, renaming, and removing travellers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, handling login state and restoring identities.",
  "frontend/src/hooks/useLedgerLocalState.ts": "Manages local ledger state with travellers, daily trip data, payments, expenses, and date range, persisting changes to localStorage.",
  "frontend/src/hooks/useQueries.ts": "Wraps react-query hooks to fetch and update the caller’s user profile via an actor API.",
  "frontend/src/index.css": "Defines Tailwind CSS layers and theme variables for light/dark modes with custom palette and base styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/utils/dateRange.ts": "Utility for generating date ranges and formatting dates for keys and display.",
  "frontend/src/utils/exportExcel.ts": "Builds CSV data for daily trip grids and summary calculations, then triggers file downloads.",
  "frontend/src/utils/exportReport.ts": "Exports filtered ledger data to CSV across multiple sections like grid, summary, payments, and expenses.",
  "frontend/src/utils/money.ts": "Formats numbers as INR currency and parses currency strings back to numbers.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash routing), storing and retrieving them from sessionStorage, and syncing URL values to storage.",
  "frontend/src/utils/weekendInclusion.ts": "Defines functions to detect weekend days and determine whether dates are included or editable based on Saturday/Sunday inclusion flags.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, container settings, animations, and plugins including typography, container queries, and animations.",
  "project_state.json": "Stores the project's state, including feature definitions, weekend inclusion requirements, tab UI goals, and report-generation plans."
}