{
  "backend/main.mo": "Motoko actor defining user profiles, balances, travel entries, and charge creation with access‑controlled queries and updates.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend source files for reference.",
  "frontend/index.css": "Empty stylesheet file.",
  "frontend/index.html": "HTML entry point bootstrapping the app and loading main.tsx.",
  "frontend/src/App.tsx": "Root component handling auth state, profile setup, and main ledger page rendering with theme and query reset on logout.",
  "frontend/src/components/AppHeader.tsx": "Header with branding and a user menu showing profile initials and logout.",
  "frontend/src/components/AuthGate.tsx": "Authentication guard showing login UI until Internet Identity is available.",
  "frontend/src/components/EmptyState.tsx": "Reusable empty‑state display with optional illustration, icon, and action button.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter and save their name with validation.",
  "frontend/src/components/ResponsiveTableShell.tsx": "Scrollable wrapper adding horizontal scroll support for wide tables.",
  "frontend/src/features/ledger/CarExpensesPanel.tsx": "UI for adding and listing car expenses with category selection, validation, and date‑range totals.",
  "frontend/src/features/ledger/CashPaymentForm.tsx": "Form dialog for adding a cash payment with amount, date, and optional note, including validation and toast notifications.",
  "frontend/src/features/ledger/ClearDataPanel.tsx": "Admin panel for unlocking and triggering various ledger data clear operations with confirmation dialogs and toasts.",
  "frontend/src/features/ledger/DailyParticipationGrid.tsx": "Grid interface for marking travellers' AM/PM trip participation across a date range with bulk actions and save handling.",
  "frontend/src/features/ledger/DateRangePicker.tsx": "Popover-based UI for selecting start and end dates for the ledger date range.",
  "frontend/src/features/ledger/DeleteCarExpenseAlertDialog.tsx": "Alert dialog to confirm deletion of a car expense and show a success toast.",
  "frontend/src/features/ledger/DeleteCashPaymentAlertDialog.tsx": "Alert dialog to confirm deletion of a cash payment with a corresponding toast.",
  "frontend/src/features/ledger/EditCarExpenseDialog.tsx": "Dialog for editing a car expense with validation and update submission.",
  "frontend/src/features/ledger/EditCashPaymentDialog.tsx": "Dialog to edit an existing cash payment, validate amount, and submit updates.",
  "frontend/src/features/ledger/ExpenseHistoryDialog.tsx": "Wrapper dialog that toggles and displays the expense history view.",
  "frontend/src/features/ledger/ExpenseHistoryView.tsx": "Displays car expenses with filtering, searching, sorting, and edit/delete actions.",
  "frontend/src/features/ledger/ExportButton.tsx": "Button that opens the export report dialog.",
  "frontend/src/features/ledger/ExportReportDialog.tsx": "Dialog for exporting reports with format selection and filter options.",
  "frontend/src/features/ledger/LedgerPage.tsx": "Main ledger page with tabs, controls, date range, summaries, and dialogs.",
  "frontend/src/features/ledger/LedgerStateContext.tsx": "Context provider exposing ledger state, actions, and hooks for app-wide access.",
  "frontend/src/features/ledger/OtherPendingAmountForm.tsx": "Dialog form to add a pending amount for a traveller with validation.",
  "frontend/src/features/ledger/OverallSummaryPanel.tsx": "Computes total income, expenses, and profit for a date range and generates month‑wise financial breakdown, rendering an overall summary UI.",
  "frontend/src/features/ledger/PaymentHistoryDialog.tsx": "Provides a dialog that opens a scrollable payment history view using a trigger button.",
  "frontend/src/features/ledger/PaymentHistoryView.tsx": "Displays cash payments filtered by date range and traveller with edit/delete actions and a sortable table.",
  "frontend/src/features/ledger/RatePerTripControl.tsx": "Lets the user view and edit the per‑trip rate with validation and synced input state.",
  "frontend/src/features/ledger/SettingsPanel.tsx": "Handles exporting and restoring ledger backups, including file validation, confirmation, and UI feedback.",
  "frontend/src/features/ledger/SummaryPanel.tsx": "Generates per‑traveller trip counts, charges, payments, and balances for a date range and displays them in a summary UI.",
  "frontend/src/features/ledger/TravellerManager.tsx": "Manages adding, editing, and deleting travellers, blocking removal when outstanding balances exist.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity, handling auth client setup, login, logout, and identity state.",
  "frontend/src/hooks/useLedgerLocalState.ts": "Manages local ledger state, loads from backend, updates fields, and auto-persists changes.",
  "frontend/src/hooks/useLedgerQueries.ts": "Defines React Query hooks for loading, saving, exporting, restoring, and clearing ledger data via the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Query hooks for fetching and saving the caller's user profile through the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup with custom theme variables and improved base/table styling for light and dark modes.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/types/ledger.ts": "Shared TypeScript interfaces representing ledger entities, state structure, and backup format.",
  "frontend/src/utils/dateRange.ts": "Utility functions to list days in a date range and format dates for keys and display.",
  "frontend/src/utils/exportExcel.ts": "Generates CSV exports of ledger data including daily grids and summary calculations, triggering a file download.",
  "frontend/src/utils/exportReport.ts": "Builds CSV sections for daily grids and summaries and triggers file download based on ledger state and filters.",
  "frontend/src/utils/ledgerBalances.ts": "Computes a traveller’s balance by summing trips, charges, payments, and other pending amounts within a date range.",
  "frontend/src/utils/money.ts": "Formats numbers as INR currency and parses currency strings into numeric values.",
  "frontend/src/utils/tripCalculations.ts": "Calculates total and monthly income from daily trip data, respecting date range and weekend inclusion.",
  "frontend/src/utils/urlParams.ts": "Gets, stores, retrieves, and clears URL and session parameters, including hash‑based routing support.",
  "frontend/src/utils/weekendInclusion.ts": "Determines if dates fall on weekends and whether they should be included or editable based on settings.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, fonts, animations, and plugins for the frontend.",
  "project_state.json": "Describes project state and lists required features for fixing backup/export and adding canister-backed persistence."
}