{
  "backend/main.mo": "Motoko canister defining user profiles, payments, monetary events, travel entries, and app data storage with access control and profile save/fetch methods.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files and their responsibilities.",
  "frontend/index.css": "Empty stylesheet placeholder for global CSS.",
  "frontend/index.html": "HTML entry point loading the root React app via main.tsx.",
  "frontend/src/App.tsx": "Top-level app component handling authentication, profile setup, and rendering the ledger page within providers and an error boundary.",
  "frontend/src/components/AppErrorBoundary.tsx": "Error boundary that displays a fallback UI with reload option and optional error details.",
  "frontend/src/components/AppHeader.tsx": "Header with branding, sync status, user dropdown, and logout functionality that clears identity, cache, and local storage.",
  "frontend/src/components/AuthGate.tsx": "Authentication wrapper showing a login screen until identity is established, then rendering children.",
  "frontend/src/components/EmptyState.tsx": "Reusable empty state component showing an icon or illustration, text, and an optional action button.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users for their name and saving the profile with validation and toast feedback.",
  "frontend/src/components/ResponsiveTableShell.tsx": "Wrapper providing a scrollable horizontal area for tables with optional custom classes.",
  "frontend/src/components/SyncStatusIndicator.tsx": "Displays sync status with icons and optional last-sync timestamp.",
  "frontend/src/features/ledger/BackupRestorePanel.tsx": "Handles exporting ledger data to a file and restoring backups with confirmation and merge logic.",
  "frontend/src/features/ledger/CarExpensesPanel.tsx": "Manages car expense entry, auto-toll settings, and totals calculation within a date range.",
  "frontend/src/features/ledger/CashPaymentForm.tsx": "Dialog form for recording a cash payment for a traveller with validation and toast feedback.",
  "frontend/src/features/ledger/ClearDataPanel.tsx": "Provides password-protected actions to clear various categories of ledger data with confirmation dialogs.",
  "frontend/src/features/ledger/CoTravellerIncomeDialog.tsx": "Dialog for adding income from co-travellers with date selection and validation.",
  "frontend/src/features/ledger/DailyParticipationGrid.tsx": "Renders a grid for marking AM/PM trips per traveller by date, including weekend toggles and save actions.",
  "frontend/src/features/ledger/DateRangePicker.tsx": "Provides UI controls for selecting start and end dates using popover calendars.",
  "frontend/src/features/ledger/DeleteCarExpenseAlertDialog.tsx": "Confirmation dialog for deleting a car expense and triggering a toast notification.",
  "frontend/src/features/ledger/DeleteCashPaymentAlertDialog.tsx": "Confirmation dialog for deleting a cash payment tied to a traveller with toast feedback.",
  "frontend/src/features/ledger/DeleteTripHistoryRowAlertDialog.tsx": "Dialog confirming deletion of a trip or co-traveller income entry for a specific date.",
  "frontend/src/features/ledger/EditCarExpenseDialog.tsx": "Form dialog for editing a car expense's category, amount, date, and note with validation.",
  "frontend/src/features/ledger/EditCashPaymentDialog.tsx": "Dialog for editing a traveller's cash payment amount, date, and optional note.",
  "frontend/src/features/ledger/EditCoTravellerIncomeDialog.tsx": "Dialog for updating co-traveller income details including amount, date, and note with basic validation.",
  "frontend/src/features/ledger/EditTripHistoryTravellerDialog.tsx": "Dialog to edit a traveller’s morning/evening participation for a specific date and save changes.",
  "frontend/src/features/ledger/ExpenseHistoryDialog.tsx": "Modal wrapper displaying the expense history view with scrollable content.",
  "frontend/src/features/ledger/ExpenseHistoryView.tsx": "Shows car expenses with filtering, searching, sorting, and edit/delete controls.",
  "frontend/src/features/ledger/ExportButton.tsx": "Button that opens the export report dialog.",
  "frontend/src/features/ledger/ExportReportDialog.tsx": "Dialog to export ledger data with selectable formats, sections, and traveller filters.",
  "frontend/src/features/ledger/LedgerPage.tsx": "Main ledger page managing tabs, dialogs, mobile navigation, and unsaved-change handling.",
  "frontend/src/features/ledger/LedgerStateContext.tsx": "Context provider exposing ledger state, data, and mutation functions from local state hooks.",
  "frontend/src/features/ledger/MobileLedgerSidebarNav.tsx": "Mobile sidebar navigation listing ledger tabs and actions like history and export.",
  "frontend/src/features/ledger/OtherPendingAmountForm.tsx": "Dialog form for adding an 'other pending' amount for a traveller, with validation and submission handling.",
  "frontend/src/features/ledger/OverallSummaryPanel.tsx": "Computes and displays total income, expenses, profit/loss, and monthly breakdowns for the selected date range.",
  "frontend/src/features/ledger/PaymentHistoryDialog.tsx": "Dialog wrapper that displays the payment history view with scrollable content.",
  "frontend/src/features/ledger/PaymentHistoryView.tsx": "Shows a filterable, sortable table of cash payments with edit/delete actions within the date range.",
  "frontend/src/features/ledger/PaymentSummaryPanel.tsx": "Calculates per-traveller totals for charges, payments, pending amounts, and balances, plus overall totals.",
  "frontend/src/features/ledger/RatePerTripControl.tsx": "Input control for viewing and updating the global rate charged per trip with validation.",
  "frontend/src/features/ledger/SummaryPanel.tsx": "Displays per-traveller trip counts, charges, payments, pending amounts, and balances for the selected range.",
  "frontend/src/features/ledger/SummaryPanelActionsCell.tsx": "Renders action buttons allowing adding cash payments and other pending amounts for a traveller.",
  "frontend/src/features/ledger/TravellerManager.tsx": "UI component to add, edit, and remove travellers, blocking deletion when balances are unsettled.",
  "frontend/src/features/ledger/TripHistoryPanel.tsx": "Generates and displays trip and income history rows with edit/delete dialogs based on date range and ledger data.",
  "frontend/src/features/ledger/UnsavedChangesConfirmDialog.tsx": "A modal dialog prompting users to stay or discard unsaved changes on the participation page.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAppDataSync.ts": "Handles periodic sync and merge of local ledger state with backend data, including conflict resolution and debounced saves.",
  "frontend/src/hooks/useAutoTollSettings.ts": "Manages auto-toll configuration in localStorage with helpers to enable, disable, and adjust the toll amount.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and exposing login/logout state.",
  "frontend/src/hooks/useLedgerLocalState.ts": "React hook managing ledger state with localStorage persistence, including travellers, trips, payments, expenses, and date ranges.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks to fetch and save the current user's profile through an actor API.",
  "frontend/src/index.css": "Tailwind CSS base and theme variables defining light/dark palettes and improved table styling.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, identity provider, and global styles.",
  "frontend/src/utils/backupRestore.ts": "Utility for exporting, importing, validating, and merging ledger backup JSON files.",
  "frontend/src/utils/dateRange.ts": "Date utilities for formatting, generating ranges, and extracting weekdays.",
  "frontend/src/utils/exportExcel.ts": "Generates and downloads CSV exports of daily trip grids and summary calculations.",
  "frontend/src/utils/exportPdf.ts": "Builds printable HTML for PDF export with configurable ledger sections and traveller filters.",
  "frontend/src/utils/exportReport.ts": "Builds CSV export sections for daily grids, traveller summaries, payments, and expenses using ledger state and filters.",
  "frontend/src/utils/ledgerBalances.ts": "Computes a traveller’s balance by summing trip charges and pending amounts minus payments within a date range.",
  "frontend/src/utils/money.ts": "Formats amounts as INR currency and parses currency strings into numbers.",
  "frontend/src/utils/paymentStatus.ts": "Derives payment status and styling info based on positive, negative, or zero balance.",
  "frontend/src/utils/tripCalculations.ts": "Calculates total and monthly income from daily trip data and co-traveller income within a date range.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/src/utils/weekendInclusion.ts": "Determines weekend inclusion rules for editing and calculations based on settings and saved trip data.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending theming, colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Defines project state, required UI fixes, and feature restoration tasks including logout menu addition, multi-device sync, responsive date-range UI, desktop navigation visibility, and PDF/Excel export enablement."
}