{
  "backend/main.mo": "Actor implementing access-controlled user profile storage plus types for dates, payments, monetary events, travel entries, and travellers, with backup import/export and profile merge logic.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to their corresponding source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend source file in the project.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend styles.",
  "frontend/index.html": "Basic HTML shell that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main application component handling authentication, profile setup gating, and rendering the ledger page with theming and toasts.",
  "frontend/src/components/AppHeader.tsx": "Header displaying the app title and a user dropdown with principal info and logout support.",
  "frontend/src/components/AuthGate.tsx": "Authentication gate that shows a login screen when unauthenticated and renders children once logged in.",
  "frontend/src/components/EmptyState.tsx": "Generic empty-state component showing an icon or illustration, text, and an optional action button.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal shown to new users prompting them to enter and save their name before accessing the app.",
  "frontend/src/components/ResponsiveTableShell.tsx": "Scrollable wrapper for tables that provides horizontal scrolling via a scroll area component.",
  "frontend/src/features/ledger/BackupRestorePanel.tsx": "Handles exporting local and backend ledger data to a backup file and restoring from uploaded backups with confirmation for draft conflicts.",
  "frontend/src/features/ledger/CarExpensesPanel.tsx": "Manages adding car expenses, validating inputs, listing totals by category, and displaying expenses within the selected date range.",
  "frontend/src/features/ledger/CashPaymentForm.tsx": "Provides a dialog form for recording cash payments for a traveller with validation and submission handling.",
  "frontend/src/features/ledger/ClearDataPanel.tsx": "Implements a password‑protected interface to clear various categories of ledger data with confirmation dialogs.",
  "frontend/src/features/ledger/DailyParticipationGrid.tsx": "Displays and edits daily AM/PM trip participation for travellers, supports bulk actions, weekend inclusion, and saving draft data.",
  "frontend/src/features/ledger/DateRangePicker.tsx": "Lets users pick start and end dates for the ledger using popover calendar controls.",
  "frontend/src/features/ledger/DeleteCarExpenseAlertDialog.tsx": "Shows a confirmation dialog for deleting a car expense and triggers deletion with a success toast.",
  "frontend/src/features/ledger/DeleteCashPaymentAlertDialog.tsx": "Confirmation dialog for deleting a cash payment and showing a success toast upon deletion.",
  "frontend/src/features/ledger/EditCarExpenseDialog.tsx": "Dialog for editing a car expense with form validation and updates to the ledger state.",
  "frontend/src/features/ledger/EditCashPaymentDialog.tsx": "Dialog allowing users to edit a traveller’s cash payment with basic validation and update handling.",
  "frontend/src/features/ledger/ExpenseHistoryDialog.tsx": "Dialog wrapper that opens the expense history view in a scrollable modal.",
  "frontend/src/features/ledger/ExpenseHistoryView.tsx": "Displays a filterable and searchable list of car expenses with edit and delete controls.",
  "frontend/src/features/ledger/ExportButton.tsx": "Button that triggers the export report dialog.",
  "frontend/src/features/ledger/ExportReportDialog.tsx": "Configurable export dialog allowing users to choose format, filters, and travellers before generating a report.",
  "frontend/src/features/ledger/LedgerPage.tsx": "Main ledger page assembling date controls, history dialogs, export, and tabbed navigation across all ledger features.",
  "frontend/src/features/ledger/LedgerStateContext.tsx": "Provides a React context and provider exposing all ledger state and mutation functions from useLedgerLocalState.",
  "frontend/src/features/ledger/OtherPendingAmountForm.tsx": "Dialog form allowing users to add a new 'other pending' amount for a traveller with validation and submission handling.",
  "frontend/src/features/ledger/OverallSummaryPanel.tsx": "Computes and displays overall income, expenses, and monthly breakdowns based on daily data and car expenses within a date range.",
  "frontend/src/features/ledger/PaymentHistoryDialog.tsx": "Opens a dialog containing the payment history view for cash payments within the selected date range.",
  "frontend/src/features/ledger/PaymentHistoryView.tsx": "Displays a filterable, sortable table of cash payments with edit and delete actions.",
  "frontend/src/features/ledger/RatePerTripControl.tsx": "Input control for viewing and updating the rate charged per trip with basic validation.",
  "frontend/src/features/ledger/SummaryPanel.tsx": "Generates per-traveller trip counts, charges, payments, pending amounts, and balances for the selected date range.",
  "frontend/src/features/ledger/TravellerManager.tsx": "UI component to add, edit, and remove travellers, blocking deletion if balance is nonzero.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, and stored identity loading.",
  "frontend/src/hooks/useLedgerLocalState.ts": "Manages local ledger state with persistence, including travellers, trips, payments, expenses, and date range.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend calls for user profiles and backup import/export.",
  "frontend/src/index.css": "Tailwind base styles and theme variables for light/dark modes with custom palette.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, and Internet Identity provider.",
  "frontend/src/utils/backupRestore.ts": "Utilities to export, import, and merge ledger backup data between local and backend states.",
  "frontend/src/utils/dateRange.ts": "Helpers for generating date ranges and formatting date keys and display strings.",
  "frontend/src/utils/exportExcel.ts": "Generates CSV exports for daily trip grids and traveller summaries, including counts, charges, and payments. Handles CSV formatting and triggers file downloads.",
  "frontend/src/utils/exportReport.ts": "Creates configurable CSV reports with daily grids, summaries, payments, car expenses, and overall totals. Supports filtering travellers and optional sections.",
  "frontend/src/utils/ledgerBalances.ts": "Computes a traveller’s balance by calculating trips, charges, payments, and other pending amounts within a date range. Respects weekend inclusion rules.",
  "frontend/src/utils/money.ts": "Formats numbers as INR currency and parses currency strings into numeric values.",
  "frontend/src/utils/tripCalculations.ts": "Calculates income totals and monthly income breakdowns from daily trip data while honoring weekend inclusion settings.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL query params, persist them in sessionStorage, and clean parameters from URL hashes.",
  "frontend/src/utils/weekendInclusion.ts": "Determines whether dates fall on weekends and whether they should be included or editable based on configuration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining themes, colors, typography, animations, and plugin setup.",
  "project_state.json": "Defines project requirements for adding a Backup & Restore feature that exports all stored data as JSON and restores by merging imported JSON. Lists existing features, new requests, and architectural notes for implementing deterministic merge behavior."
}