{
  "backend/main.mo": "Main actor defining data models, access control, and user profile CRUD with supporting maps for ledger, travellers, incomes, and entries.",
  "backend/migration.mo": "Migration module converting old traveller records to new schema by renaming 'name' to 'pseudo' and returning updated actor state.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend components and utilities.",
  "frontend/index.css": "Empty stylesheet placeholder.",
  "frontend/index.html": "Root HTML file bootstrapping the React app with main.tsx and metadata.",
  "frontend/src/App.tsx": "Root React component handling authentication state, profile setup modal, and rendering the ledger page with theming and toasts.",
  "frontend/src/components/AppHeader.tsx": "Header component showing branding, sync status, and logout controls with local storage and query cache clearing.",
  "frontend/src/components/AuthGate.tsx": "Authentication guard that shows a login screen until the user is authenticated via Internet Identity.",
  "frontend/src/components/EmptyState.tsx": "Reusable UI component displaying an icon or illustration with title, description, and optional action button.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for first‑time profile creation allowing users to enter and save their name with validation and toast feedback.",
  "frontend/src/components/ResponsiveTableShell.tsx": "Wrapper adding horizontal scroll and border styling around table content.",
  "frontend/src/components/SyncStatusIndicator.tsx": "Displays sync status with icons, text, and relative last-sync time.",
  "frontend/src/features/ledger/BackupRestorePanel.tsx": "Provides UI to export ledger backups, import backups, and handle merge/restore confirmations.",
  "frontend/src/features/ledger/CarExpensesPanel.tsx": "Manages car expense entry, auto-toll settings, and calculates totals for the selected date range.",
  "frontend/src/features/ledger/CashPaymentForm.tsx": "Dialog form for recording cash payments for a traveller with validation and toast feedback.",
  "frontend/src/features/ledger/ClearDataPanel.tsx": "Password‑protected panel to clear various ledger data categories with confirmation dialogs.",
  "frontend/src/features/ledger/CoTravellerIncomeDialog.tsx": "Dialog to add or edit income records from co‑travellers with validation and date selection.",
  "frontend/src/features/ledger/DailyParticipationGrid.tsx": "Renders a table for marking traveller AM/PM trip participation by date with bulk toggles, weekend inclusion settings, and save actions.",
  "frontend/src/features/ledger/DateRangePicker.tsx": "UI control for selecting start and end dates using popover calendars tied to ledger state.",
  "frontend/src/features/ledger/DeleteCarExpenseAlertDialog.tsx": "Confirmation dialog for deleting a car expense and showing a success toast.",
  "frontend/src/features/ledger/DeleteCashPaymentAlertDialog.tsx": "Confirmation dialog for deleting a traveller’s cash payment with a success toast.",
  "frontend/src/features/ledger/DeleteTripHistoryEntryAlertDialog.tsx": "Confirmation dialog for deleting a trip history entry, optionally clearing traveller trips for that date.",
  "frontend/src/features/ledger/EditCarExpenseDialog.tsx": "Dialog for editing a car expense with fields for date, category, amount, and note, including validation.",
  "frontend/src/features/ledger/EditCashPaymentDialog.tsx": "Dialog for editing a cash payment’s amount, date, and note with validation and update handling.",
  "frontend/src/features/ledger/EditTripHistoryTravellerDialog.tsx": "Dialog for editing a traveller’s morning/evening trip participation for a specific date.",
  "frontend/src/features/ledger/ExpenseHistoryDialog.tsx": "Dialog wrapper displaying the expense history view with scrolling support.",
  "frontend/src/features/ledger/ExpenseHistoryView.tsx": "Displays, filters, searches, sorts, edits, and deletes car expenses within a selected date range.",
  "frontend/src/features/ledger/ExportButton.tsx": "Renders an export button that opens the report export dialog.",
  "frontend/src/features/ledger/ExportReportDialog.tsx": "Provides a dialog for exporting ledger data with format, report type, and filter options, triggering CSV or PDF generation.",
  "frontend/src/features/ledger/LedgerPage.tsx": "Main ledger page managing tabs, dialogs, sidebar actions, and syncing while rendering all ledger panels.",
  "frontend/src/features/ledger/LedgerStateContext.tsx": "Context provider exposing ledger state and actions sourced from useLedgerLocalState.",
  "frontend/src/features/ledger/MobileLedgerSidebarNav.tsx": "Mobile sidebar navigation listing ledger tabs and quick actions like payment history, expense history, and export.",
  "frontend/src/features/ledger/OtherPendingAmountForm.tsx": "Dialog form for adding other pending amounts to a traveller with validation and submission handling.",
  "frontend/src/features/ledger/OverallSummaryPanel.tsx": "Computes total income, expenses, profit/loss, and monthly breakdowns from daily data and renders an overall financial summary UI.",
  "frontend/src/features/ledger/PaymentHistoryDialog.tsx": "Wraps the payment history view inside a dialog with header and scrollable content.",
  "frontend/src/features/ledger/PaymentHistoryView.tsx": "Displays a filterable, sortable table of cash payments with edit/delete actions and traveller-based filtering.",
  "frontend/src/features/ledger/PaymentSummaryPanel.tsx": "Calculates per‑traveller total charges, payments, dues, and overall totals, and renders a payment summary table.",
  "frontend/src/features/ledger/RatePerTripControl.tsx": "Provides an input control to view and update the per‑trip rate with validation and formatting.",
  "frontend/src/features/ledger/SummaryPanel.tsx": "Generates per‑traveller trip counts, charges, payments, pending amounts, and balances, and displays detailed summaries with forms for adding payments.",
  "frontend/src/features/ledger/TravellerManager.tsx": "Manages traveller list creation, renaming, and deletion with balance checks to prevent removing travellers who have outstanding dues.",
  "frontend/src/features/ledger/TripHistoryPanel.tsx": "Builds and displays a sorted list of traveller and co‑traveller trip entries with edit/delete dialogs and totals.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAppDataSync.ts": "Handles periodic syncing and merging of local ledger state with remote app data using an authenticated actor.",
  "frontend/src/hooks/useAutoTollSettings.ts": "Manages persisted auto‑toll settings with localStorage-backed state and simple setters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity login, loading stored identities, and managing authentication state.",
  "frontend/src/hooks/useLedgerLocalState.ts": "Maintains and persists all local ledger state including travellers, trips, payments, expenses, and settings with merge helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines react‑query hooks for fetching and saving the caller's user profile through the backend actor.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables for light/dark themes and improved table readability.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/src/utils/accountingStatements.ts": "Generates monthly, profit/loss, income, and expense statements from ledger data by aggregating trips, co‑traveller income, and car expenses. Core logic computes month‑wise income and expenses based on date filtering and trip counts.",
  "frontend/src/utils/backupRestore.ts": "Provides JSON backup/export and file‑based restore of ledger state, including validation and merging of local and remote states. Handles traveller merging and OR‑based trip data merging.",
  "frontend/src/utils/dateRange.ts": "Utility functions for generating date ranges, formatting dates, and extracting weekdays within a range. Includes helpers for current week Monday–Friday selection.",
  "frontend/src/utils/exportExcel.ts": "Generates CSV‑structured data for Excel export, including a daily AM/PM trip grid and per‑traveller trip/payment summary. Handles weekend rules, payments filtering, and download initiation.",
  "frontend/src/utils/exportPdf.ts": "Builds HTML‑based PDF reports including standard, monthly, profit/loss, income, and expense formats. Integrates ledger calculations, date filtering, and styling for PDF output.",
  "frontend/src/utils/exportReport.ts": "Exports ledger data to CSV with options for daily grid, traveller summaries, payments, and expenses, using filters to customize output. Also routes PDF export requests to the PDF generator.",
  "frontend/src/utils/ledgerBalances.ts": "Calculates per‑traveller balance by counting trips, computing charges, and subtracting payments within a date range. Supports weekend inclusion rules and optional pending adjustments.",
  "frontend/src/utils/money.ts": "Provides helpers to format INR currency and parse currency strings into numeric values.",
  "frontend/src/utils/tripCalculations.ts": "Computes total and monthly income from trip data, considering weekend inclusion rules and co‑traveller income.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, persisting, and clearing URL parameters with sessionStorage support and hash routing compatibility.",
  "frontend/src/utils/weekendInclusion.ts": "Determines whether dates, including weekends with saved data, should be included or editable in calculations.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, plugins, colors, fonts, animations, and container settings for the frontend UI.",
  "project_state.json": "Describes the project’s requirements and state for enhancing export reports and financial statements without affecting DataSync."
}