{
  "backend/main.mo": "Main Motoko actor defining data types (UserProfile, Payment, MonetaryEvent, TravelEntry, Traveller, CoTravellerIncome, AppData) and implementing CRUD operations for user profiles and app data with role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: auto-toll weekday checking/adding on app launch (REQ-1) and multi-category expense form for simultaneous Toll/CNG BRD/CNG AHM entries (REQ-2).",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, hooks, and utilities for the carpool ledger application with authentication, ledger management, and export functionality.",
  "frontend/index.css": "Empty CSS file (no content).",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the daily car-pooling payment tracker application.",
  "frontend/src/App.tsx": "Root component managing authentication flow, profile setup modal, auto-toll logic (adds toll once per weekday on launch if not already added for that date), and renders LedgerPage with theme provider and toast notifications.",
  "frontend/src/components/AppHeader.tsx": "Sticky header with app branding, sync status indicator, and user dropdown menu with logout functionality that clears React Query cache, local storage, and triggers parent callback.",
  "frontend/src/components/AuthGate.tsx": "Authentication gate component displaying a login screen with Internet Identity integration for unauthenticated users and rendering children for authenticated users.",
  "frontend/src/components/EmptyState.tsx": "Reusable empty state component displaying an icon/illustration, title, description, and optional action button for empty data scenarios.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup requiring name input, with prevented outside clicks/escape key and profile save mutation integration.",
  "frontend/src/components/ResponsiveTableShell.tsx": "Wrapper component providing horizontal scrolling for tables on mobile devices using ScrollArea with horizontal scrollbar.",
  "frontend/src/components/SyncStatusIndicator.tsx": "Displays sync status (syncing, synced, failed) with icons and time-ago text. Shows cloud icons with animation for syncing state and error messages for failures.",
  "frontend/src/features/ledger/BackupRestorePanel.tsx": "Provides UI for exporting ledger data to JSON file and importing/restoring from backup files. Includes confirmation dialog for restoring when draft changes exist and uses non-destructive merge.",
  "frontend/src/features/ledger/CarExpensesPanel.tsx": "Manages car expense tracking with predefined categories (CNG, Petrol, Toll, etc.), auto-toll settings, and multi-category expense forms. Calculates and displays category totals for the current date range.",
  "frontend/src/features/ledger/CashPaymentForm.tsx": "Dialog form component for recording cash payments to travellers. Validates amount input and allows adding optional notes and date selection.",
  "frontend/src/features/ledger/ClearDataPanel.tsx": "Password-protected panel for clearing ledger data with granular options (all data, daily trips, cash payments, other pending, car expenses). Requires password '7Days#Week' and shows confirmation dialogs.",
  "frontend/src/features/ledger/CoTravellerIncomeDialog.tsx": "Dialog form for adding or editing other co-traveller income entries. Supports amount, date picker, and optional notes with validation and submission handling.",
  "frontend/src/features/ledger/DailyParticipationGrid.tsx": "Displays a grid for tracking daily morning and evening trip participation for travellers, with bulk toggle controls, weekend inclusion settings, and save functionality. Includes responsive table layout with per-date and per-traveller checkboxes, showing trip counts and costs.",
  "frontend/src/features/ledger/DateRangePicker.tsx": "Provides a date range picker component with two calendar popovers for selecting start and end dates. Supports both controlled mode via props and uncontrolled mode using LedgerStateContext.",
  "frontend/src/features/ledger/DeleteCarExpenseAlertDialog.tsx": "Confirmation dialog for deleting a car expense entry, displaying the category and amount. Shows a destructive action button and displays a success toast on confirmation.",
  "frontend/src/features/ledger/DeleteCashPaymentAlertDialog.tsx": "Confirmation dialog for deleting a cash payment entry, displaying the traveller name and amount. Shows a destructive action button and displays a success toast on confirmation.",
  "frontend/src/features/ledger/DeleteTripHistoryEntryAlertDialog.tsx": "Confirmation dialog for deleting a trip history entry for either a traveller or co-traveller. Displays entry details (name, date, type) and warns that the action cannot be undone.",
  "frontend/src/features/ledger/EditCarExpenseDialog.tsx": "Dialog form for editing an existing car expense with fields for category, amount, date, and optional note. Includes validation for required fields and displays success toast on update.",
  "frontend/src/features/ledger/EditCashPaymentDialog.tsx": "Dialog form for editing an existing cash payment with fields for amount, date, and optional note. Includes validation for positive amounts and displays success toast on update.",
  "frontend/src/features/ledger/EditTripHistoryTravellerDialog.tsx": "Dialog form for editing a traveller's trip participation (morning/evening checkboxes) for a specific date. Updates trip data via LedgerStateContext and shows success/error toasts.",
  "frontend/src/features/ledger/ExpenseHistoryDialog.tsx": "Wrapper dialog component that displays the ExpenseHistoryView in a modal with scrollable content. Provides title and description for viewing and managing expense records.",
  "frontend/src/features/ledger/ExpenseHistoryView.tsx": "Displays a filterable and searchable table of car expenses with edit and delete actions, including category filtering and date range filtering. Shows an empty state when no expenses exist.",
  "frontend/src/features/ledger/ExportButton.tsx": "Simple button component that opens the ExportReportDialog when clicked, displaying a download icon and 'Export' label.",
  "frontend/src/features/ledger/ExportReportDialog.tsx": "Dialog for exporting ledger reports in CSV or PDF format with multiple report types (standard, monthly, profit/loss, income, expense), section filters, traveller selection, and independent date range controls.",
  "frontend/src/features/ledger/LedgerPage.tsx": "Main ledger page component with tabbed navigation (travellers, daily grid, summary, expenses, etc.), per-tab date range management, unsaved changes detection, and mobile sidebar support. Integrates data sync and manages multiple dialog states.",
  "frontend/src/features/ledger/LedgerStateContext.tsx": "React context provider that wraps useLedgerLocalState hook and exposes all ledger state and actions (travellers, daily data, payments, expenses, etc.) to child components.",
  "frontend/src/features/ledger/MobileLedgerSidebarNav.tsx": "Mobile sheet sidebar navigation component displaying menu items for all ledger tabs and action buttons for payment history, expense history, and export.",
  "frontend/src/features/ledger/MonthYearRangeSelector.tsx": "Dropdown selectors for choosing month and year ranges, supporting full month, full year, and custom range classifications with automatic range updates.",
  "frontend/src/features/ledger/MultiCategoryExpenseForm.tsx": "Dialog form component for adding three predefined car expenses (Toll, CNG BRD, CNG AHM) simultaneously with individual amounts and dates.",
  "frontend/src/features/ledger/OtherPendingAmountForm.tsx": "Dialog form component for adding additional pending amounts to a traveller's account with optional notes and date selection.",
  "frontend/src/features/ledger/OverallMonthYearSelector.tsx": "Empty file with no content.",
  "frontend/src/features/ledger/OverallSummaryPanel.tsx": "Card component displaying overall financial summary including total income, expenses, profit/loss, and monthly breakdowns calculated from daily trip data and car expenses.",
  "frontend/src/features/ledger/PaymentHistoryDialog.tsx": "Dialog wrapper component that displays the PaymentHistoryView for viewing all cash payments within the selected date range.",
  "frontend/src/features/ledger/PaymentHistoryView.tsx": "Table view component for displaying, filtering, editing, and deleting cash payment records with traveller filtering and date range support.",
  "frontend/src/features/ledger/PaymentSummaryPanel.tsx": "Card component showing per-traveller payment summaries including total charges, payments received, other pending amounts, and outstanding balances with overall totals.",
  "frontend/src/features/ledger/RatePerTripControl.tsx": "Input control component for setting and displaying the rate per trip with currency formatting and validation.",
  "frontend/src/features/ledger/SummaryPanel.tsx": "Displays per-traveller summary cards showing trip counts (weekday/weekend), total charges, payments, other pending amounts, and balance status with forms to add cash payments and other pending amounts.",
  "frontend/src/features/ledger/TravellerManager.tsx": "Manages the list of travellers with add, rename, and delete functionality; prevents deletion of travellers with outstanding balances and displays empty state when no travellers exist.",
  "frontend/src/features/ledger/TripHistoryPanel.tsx": "Shows a chronological table of all trip entries (traveller trips and co-traveller income) within the date range with edit/delete actions and total trip count and amount calculations.",
  "frontend/src/features/ledger/TripsPaymentYearSelector.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAppDataSync.ts": "Manages bidirectional sync between local ledger state and remote backend with polling, debounced saves, conflict-free merging, and sync status tracking for authenticated users.",
  "frontend/src/hooks/useAutoTollSettings.ts": "Manages auto-toll settings (enabled flag, amount, last auto-toll date) with localStorage persistence and provides getter/setter functions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status with configurable AuthClient options.",
  "frontend/src/hooks/useLedgerLocalState.ts": "Custom React hook managing carpool ledger state with localStorage persistence, including travellers, daily trip data, payments, expenses, and date ranges. Provides functions to add/remove travellers, toggle trips, manage payments/expenses, and handle backup/restore operations.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and saving user profile data from the backend actor. Provides `useGetCallerUserProfile` for retrieving the current user's profile and `useSaveCallerUserProfile` mutation for updating it.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette using warm neutral and amber tones for light/dark themes. Includes base styling for tables with zebra striping and improved mobile legibility.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component with necessary context providers.",
  "frontend/src/utils/accountingStatements.ts": "Utility functions for generating financial reports including monthly breakdowns, profit/loss statements, and income/expense statements from ledger data. Calculates trip income, co-traveller income, and categorized expenses across date ranges.",
  "frontend/src/utils/backupRestore.ts": "Handles backup and restore operations for ledger state, including JSON export/import to files and validation. Provides merging logic to combine local and remote states with union-based conflict resolution.",
  "frontend/src/utils/dateRange.ts": "Date utility functions for generating and classifying date ranges (month, year, week, custom). Provides helpers for formatting dates, filtering weekdays, and determining range types for display purposes.",
  "frontend/src/utils/exportExcel.ts": "Exports ledger data to CSV format with two sheets: a daily grid showing AM/PM trips per traveller, and a summary showing total trips, charges, payments, and balances. Handles CSV formatting and browser download.",
  "frontend/src/utils/exportPdf.ts": "Generates PDF reports for carpool ledger data with multiple report types (standard, monthly, profit/loss, income, expense) using HTML templates and styling for A4 format output.",
  "frontend/src/utils/exportReport.ts": "Exports carpool ledger data to CSV format with configurable filters for travellers, daily grids, summaries, payments, and expenses; routes PDF exports to the PDF generator utility.",
  "frontend/src/utils/ledgerBalances.ts": "Calculates traveller balances by computing total trips, charges, payments, and other pending amounts within a date range, respecting weekend inclusion settings and saved trip data.",
  "frontend/src/utils/money.ts": "Provides currency formatting and parsing utilities for Indian Rupees (INR) with locale-aware formatting.",
  "frontend/src/utils/tripCalculations.ts": "Calculates total and monthly income from daily trip data and co-traveller incomes within date ranges, respecting weekend inclusion settings and saved trip data.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/src/utils/weekendInclusion.ts": "Determines weekend day status and whether dates should be included in calculations or editing based on weekend checkboxes and existing saved trip data.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, Inter/JetBrains Mono fonts, accordion animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking for Carpool Ledger expense app with existing features for auto-toll weekday addition and multi-category batch expense entry (Toll, CNG BRD, CNG AHM)."
}