{
  "backend/main.mo": "Motoko canister defining user profiles, travel and monetary data types, access‑controlled CRUD functions, and in‑memory maps for ledger and traveller state.",
  "feature_evidence.json": "Feature evidence report linking two features to affected frontend files, components, test IDs, and confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files detailing their purpose across authentication, ledger views, utilities, and UI components.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend styles.",
  "frontend/index.html": "HTML entry point that loads the React app via main.tsx and defines base page metadata.",
  "frontend/src/App.tsx": "Root React component managing authentication state, profile setup flow, theming, and rendering the ledger page.",
  "frontend/src/components/AppHeader.tsx": "Header with branding, sync indicator, and user menu including logout that clears identity, query cache, and local storage.",
  "frontend/src/components/AuthGate.tsx": "Authentication wrapper showing a login card when unauthenticated and rendering children when logged in.",
  "frontend/src/components/EmptyState.tsx": "Generic empty‑state display with optional icon or illustration and an action button.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting first‑time users to enter and save their name, blocking dismissal until completion.",
  "frontend/src/components/ResponsiveTableShell.tsx": "Wrapper providing horizontal scroll support for tables using a ScrollArea component.",
  "frontend/src/components/SyncStatusIndicator.tsx": "Component showing cloud/sync icons and relative time based on current app data sync status.",
  "frontend/src/features/ledger/BackupRestorePanel.tsx": "UI panel to export ledger state to a JSON file and restore backups with confirmation and merge logic.",
  "frontend/src/features/ledger/CarExpensesPanel.tsx": "Manages car expense entries, auto-toll settings, and manual expense creation with validation and UI dialogs.",
  "frontend/src/features/ledger/CashPaymentForm.tsx": "Dialog form to record a traveller’s cash payment with amount, date, validation, and submission handling.",
  "frontend/src/features/ledger/ClearDataPanel.tsx": "Password-protected panel allowing selective clearing of ledger data categories with confirmation dialogs.",
  "frontend/src/features/ledger/CoTravellerIncomeDialog.tsx": "Dialog to add income entries from co-travellers with amount/date input, validation, and state updates.",
  "frontend/src/features/ledger/DailyParticipationGrid.tsx": "Renders a grid for marking AM/PM trip participation per traveller, with weekend inclusion, bulk toggles, and save actions. Uses ledger state to manage draft daily trip data.",
  "frontend/src/features/ledger/DateRangePicker.tsx": "Provides a dual-date picker to update the ledger's start and end date range. Uses popover calendars for selecting dates.",
  "frontend/src/features/ledger/DeleteCarExpenseAlertDialog.tsx": "Confirmation dialog for deleting a car expense, triggering a toast on success. Calls a provided delete callback and closes the dialog.",
  "frontend/src/features/ledger/DeleteCashPaymentAlertDialog.tsx": "Confirmation dialog for deleting a cash payment for a traveller. Executes a delete callback and shows a toast message.",
  "frontend/src/features/ledger/EditCarExpenseDialog.tsx": "Dialog for editing a car expense with fields for date, category, amount, and note, including validation. Submits updates and resets when opened.",
  "frontend/src/features/ledger/EditCashPaymentDialog.tsx": "Dialog for editing a traveller's cash payment with amount, date, and note fields plus validation. Saves the updated payment and closes on success.",
  "frontend/src/features/ledger/ExpenseHistoryDialog.tsx": "Wraps ExpenseHistoryView in a dialog allowing users to view and manage car expenses. Displays history filtered by selected date range.",
  "frontend/src/features/ledger/ExpenseHistoryView.tsx": "Displays a filterable, searchable, and sortable table of car expenses within the date range. Supports editing and deleting individual expenses.",
  "frontend/src/features/ledger/ExportButton.tsx": "Button that opens the export report dialog. Toggles dialog visibility using local state.",
  "frontend/src/features/ledger/ExportReportDialog.tsx": "Dialog component for selecting report sections and travellers before exporting ledger data to CSV.",
  "frontend/src/features/ledger/LedgerPage.tsx": "Main ledger page managing tabs, dialogs, syncing, and layout for all ledger features.",
  "frontend/src/features/ledger/LedgerStateContext.tsx": "Provides React context for accessing and updating the full ledger state and its actions.",
  "frontend/src/features/ledger/MobileLedgerSidebarNav.tsx": "Mobile sidebar navigation for switching ledger tabs and opening history or export dialogs.",
  "frontend/src/features/ledger/OtherPendingAmountForm.tsx": "Form dialog for adding an additional pending amount to a traveller with validation.",
  "frontend/src/features/ledger/OverallSummaryPanel.tsx": "Computes and displays total income, expenses, profit/loss, and monthly breakdown from ledger data.",
  "frontend/src/features/ledger/PaymentHistoryDialog.tsx": "Dialog wrapper displaying the payment history list within the selected date range.",
  "frontend/src/features/ledger/PaymentHistoryView.tsx": "Filters and displays cash payments by traveller and date range, with edit and delete actions.",
  "frontend/src/features/ledger/RatePerTripControl.tsx": "Shows and updates the per‑trip rate with validation and synced input state.",
  "frontend/src/features/ledger/SummaryPanel.tsx": "Computes per‑traveller trip counts, charges, payments, pending amounts, and balances for the selected date range.",
  "frontend/src/features/ledger/TravellerManager.tsx": "Manages adding, renaming, and deleting travellers, blocking deletion when outstanding balance exists.",
  "frontend/src/features/ledger/TripHistoryPanel.tsx": "Generates a date‑sorted trip history table including regular and co‑traveller income entries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useAppDataSync.ts": "Synchronizes local ledger state with backend data via polling, merge logic, and debounced saves.",
  "frontend/src/hooks/useAutoTollSettings.ts": "Manages auto toll settings using localStorage with functions to enable/disable and update the toll amount.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login, logout, and identity persistence using AuthClient.",
  "frontend/src/hooks/useLedgerLocalState.ts": "Stores and manages carpool ledger state in localStorage, including travellers, trips, payments, expenses, and date ranges.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to fetch and save the current user's profile via an actor.",
  "frontend/src/index.css": "Tailwind-based global styles defining color themes, dark mode variables, and basic table styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/utils/backupRestore.ts": "Exports, imports, validates, and merges ledger backup files, ensuring consistent local ledger state handling.",
  "frontend/src/utils/dateRange.ts": "Provides date utility functions for formatting and generating weekday ranges, including current week calculation.",
  "frontend/src/utils/exportExcel.ts": "Generates CSV-style Excel exports of ledger data, including daily grids and summary calculations.",
  "frontend/src/utils/exportReport.ts": "Generates CSV exports for ledger data, including daily grids, summaries, payments, and car expenses based on filters and date range.",
  "frontend/src/utils/ledgerBalances.ts": "Computes a traveller’s balance by summing trips, charges, payments, and pending amounts within a date range.",
  "frontend/src/utils/money.ts": "Provides helpers for formatting INR currency values and parsing currency strings.",
  "frontend/src/utils/tripCalculations.ts": "Calculates income totals and monthly breakdowns from daily trip data, including optional co‑traveller income.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, and clearing URL and session parameters, supporting hash and query routing.",
  "frontend/src/utils/weekendInclusion.ts": "Determines whether weekend dates should be included or editable based on settings or saved trip data.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and plugins.",
  "project_state.json": "Describes project goals and features, including daily auto‑toll updates and a trip history screen with date‑range totals."
}