{
  "backend/main.mo": "Main backend canister implementing user profiles, app data storage, access control, and domain types for dates, payments, events, and travel entries.",
  "backend/migration.mo": "Migration script converting old userProfiles map into new userAppData format with timestamps and versioning.",
  "feature_evidence.json": "Metadata file listing feature implementations, linked files, components, and test IDs for development tracking.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend files for reference or documentation.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend styles.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level React component handling authentication, profile setup, and rendering the ledger page within theme and toaster providers.",
  "frontend/src/components/AppHeader.tsx": "Header bar with branding, sync status, and user menu including logout that clears caches and local storage.",
  "frontend/src/components/AuthGate.tsx": "Authentication guard rendering a login screen until the user is authenticated via Internet Identity.",
  "frontend/src/components/EmptyState.tsx": "Reusable empty-state UI component showing an icon or illustration, text, and optional action button.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users for their name and saving their profile with validation and toast feedback.",
  "frontend/src/components/ResponsiveTableShell.tsx": "Wrapper adding horizontal scroll support to tables using ScrollArea and ScrollBar UI components.",
  "frontend/src/components/SyncStatusIndicator.tsx": "Displays sync status with icons and optional last-sync timestamp, switching visuals based on syncing, synced, or failed states.",
  "frontend/src/features/ledger/BackupRestorePanel.tsx": "Provides UI to export ledger data to a backup file and restore from uploaded backups with confirmation flows and merge handling.",
  "frontend/src/features/ledger/CarExpensesPanel.tsx": "Allows adding car expenses by category, computes totals for a date range, and displays a form in a dialog.",
  "frontend/src/features/ledger/CashPaymentForm.tsx": "Dialog form for recording a traveller's cash payment with amount, date, and optional note input validation.",
  "frontend/src/features/ledger/ClearDataPanel.tsx": "Password‑protected panel offering multiple destructive data‑clear actions with confirmation dialogs.",
  "frontend/src/features/ledger/DailyParticipationGrid.tsx": "Renders a grid to mark AM/PM trips per traveller, manage weekend inclusion, and save draft participation data.",
  "frontend/src/features/ledger/DateRangePicker.tsx": "Simple popover-based picker for adjusting start and end dates of the ledger’s active date range.",
  "frontend/src/features/ledger/DeleteCarExpenseAlertDialog.tsx": "Confirmation dialog for deleting a car expense and triggering a toast notification.",
  "frontend/src/features/ledger/DeleteCashPaymentAlertDialog.tsx": "Confirmation dialog for deleting a cash payment with a success toast.",
  "frontend/src/features/ledger/EditCarExpenseDialog.tsx": "Dialog for editing car expense details with validation and update callbacks.",
  "frontend/src/features/ledger/EditCashPaymentDialog.tsx": "Dialog for editing a traveller’s cash payment, validating amount and saving updates.",
  "frontend/src/features/ledger/ExpenseHistoryDialog.tsx": "Wrapper dialog that opens a large view of car expense history.",
  "frontend/src/features/ledger/ExpenseHistoryView.tsx": "Displays and filters car expenses by date, category, and search, with edit and delete actions.",
  "frontend/src/features/ledger/ExportButton.tsx": "Button that opens the export report dialog.",
  "frontend/src/features/ledger/ExportReportDialog.tsx": "Dialog for exporting ledger data with format options, filters, and traveller selection.",
  "frontend/src/features/ledger/LedgerPage.tsx": "Main ledger page composing tabs, dialogs, and state syncing with unsaved-change handling.",
  "frontend/src/features/ledger/LedgerStateContext.tsx": "Context provider exposing ledger state, actions, and persistence helpers from useLedgerLocalState.",
  "frontend/src/features/ledger/OtherPendingAmountForm.tsx": "Dialog form for adding a pending amount to a traveller with validation and toast feedback.",
  "frontend/src/features/ledger/OverallSummaryPanel.tsx": "Computes and displays income, expenses, and monthly profit/loss summary for the selected date range.",
  "frontend/src/features/ledger/PaymentHistoryDialog.tsx": "Dialog wrapper showing the payment history view via a trigger button.",
  "frontend/src/features/ledger/PaymentHistoryView.tsx": "Displays filtered, sortable cash payment history with edit and delete controls.",
  "frontend/src/features/ledger/RatePerTripControl.tsx": "Input control for viewing and updating the per‑trip rate with validation.",
  "frontend/src/features/ledger/SummaryPanel.tsx": "Computes per‑traveller trip counts, charges, payments, and balances for a date range and renders a summary UI.",
  "frontend/src/features/ledger/TravellerManager.tsx": "Manages adding, renaming, and deleting travellers, blocking deletion if balance is not zero and rendering a list UI.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAppDataSync.ts": "Handles periodic sync between local ledger state and remote backend, merging changes and saving with conflict checks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading and managing identities via AuthClient.",
  "frontend/src/hooks/useLedgerLocalState.ts": "Maintains local ledger state with persistence in localStorage and utilities for modifying travellers, trips, payments, and settings.",
  "frontend/src/hooks/useQueries.ts": "React‑query hooks for fetching and saving the caller's user profile via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light/dark themes plus base styling for body, borders, and tables.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider wrappers.",
  "frontend/src/utils/backupRestore.ts": "Handles exporting, importing, validating, and merging backup JSON files for the ledger state.",
  "frontend/src/utils/dateRange.ts": "Provides helpers to list days in a range and format dates for keys or display.",
  "frontend/src/utils/exportExcel.ts": "Generates CSV-based Excel exports for daily trip grids and traveller summaries.",
  "frontend/src/utils/exportReport.ts": "Creates filtered CSV reports including daily grids, summaries, payments, and expenses.",
  "frontend/src/utils/ledgerBalances.ts": "Computes a traveller’s balance based on trips, payments, and pending amounts within a date range.",
  "frontend/src/utils/money.ts": "Formats and parses INR currency values.",
  "frontend/src/utils/tripCalculations.ts": "Calculates total and monthly income from trip data considering weekend inclusion rules.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL params (including hash routing), persisting them in sessionStorage, and clearing them from the hash.",
  "frontend/src/utils/weekendInclusion.ts": "Helpers to detect weekend days and determine if a date is included or editable based on Saturday/Sunday flags.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, typography, animations, and plugin setup.",
  "project_state.json": "Project state metadata describing sync-focused app behavior, existing features, and pending feature requests."
}