{
  "backend/main.mo": "Defines authorization‑protected ledger actor managing traveller profiles, monetary events, balances, and charge creation.",
  "feature_evidence.json": "Lists feature evidence metadata mapping features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of various frontend components and utilities.",
  "frontend/index.css": "Empty stylesheet placeholder.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Top-level app component handling authentication, profile setup, and rendering the ledger UI.",
  "frontend/src/components/AppHeader.tsx": "Header with branding and user menu showing profile info and logout option.",
  "frontend/src/components/AuthGate.tsx": "Authentication guard that prompts login when unauthenticated and renders children otherwise.",
  "frontend/src/components/EmptyState.tsx": "Reusable empty state display with optional icon or illustration and an action button.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal requiring new users to enter and save their name before proceeding.",
  "frontend/src/components/ResponsiveTableShell.tsx": "Scrollable wrapper providing horizontal scroll support for wide tables.",
  "frontend/src/features/ledger/CashPaymentForm.tsx": "Modal form allowing users to record a cash payment for a traveller with validation and toast feedback.",
  "frontend/src/features/ledger/DailyParticipationGrid.tsx": "Renders a date-by-traveller grid to mark AM/PM trip participation and update ledger state.",
  "frontend/src/features/ledger/DateRangePicker.tsx": "UI control for selecting start and end dates using popover calendars tied to ledger state.",
  "frontend/src/features/ledger/ExportButton.tsx": "Exports the full ledger state to CSV using exportToExcel with loading state and toasts.",
  "frontend/src/features/ledger/LedgerPage.tsx": "Main ledger UI layout combining date picker, participation grid, traveller management, summary, and export within provider-backed state.",
  "frontend/src/features/ledger/LedgerStateContext.tsx": "Context provider exposing travellers, date range, daily data, rate, and cash payment state/actions from local ledger logic.",
  "frontend/src/features/ledger/RatePerTripControl.tsx": "Input control for adjusting the per‑trip rate with validation and live formatting.",
  "frontend/src/features/ledger/SummaryPanel.tsx": "Computes per‑traveller totals for trips, charges, payments, and balances, and displays them with payment entry support.",
  "frontend/src/features/ledger/TravellerManager.tsx": "UI component to add, edit, and remove travellers using ledger state and local form logic.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useLedgerLocalState.ts": "Manages local ledger data (travellers, trips, payments, rate, date range) with localStorage persistence and migration logic.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for loading and saving the caller’s user profile using the backend actor.",
  "frontend/src/index.css": "Tailwind base styles plus custom theme variables for light/dark modes and table enhancements.",
  "frontend/src/main.tsx": "App bootstrap initializing React, Internet Identity provider, React Query, and global styles.",
  "frontend/src/utils/dateRange.ts": "Utility functions for generating date ranges and formatting date keys and labels.",
  "frontend/src/utils/exportExcel.ts": "Builds CSV exports of ledger data including daily grids and summary calculations with payments.",
  "frontend/src/utils/money.ts": "Formats and parses INR currency strings.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), store/retrieve them in sessionStorage, and manage persisted URL parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, fonts, animations, and plugins like typography and container queries.",
  "project_state.json": "Tracks the project's schema, version, high-level summary, architecture notes, and feature definitions for the car‑pooling app."
}