{
  "backend/main.mo": "Motoko actor defining user profiles, travel and monetary event types, access-controlled storage, and functions for saving and fetching user-specific app data.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Text file containing short descriptions of various frontend components and hooks used in the application.",
  "frontend/index.css": "Empty stylesheet placeholder for global CSS.",
  "frontend/index.html": "Main HTML page bootstrapping the frontend and loading the React application entry point.",
  "frontend/src/App.tsx": "Root React component handling authentication state, initial profile setup, and rendering the ledger interface with theming and toast notifications.",
  "frontend/src/components/AppHeader.tsx": "Header component displaying branding, sync status, and authenticated user menu with logout handling and cache clearing.",
  "frontend/src/components/AuthGate.tsx": "Wrapper that shows a login screen when unauthenticated and renders children once the user is logged in.",
  "frontend/src/components/EmptyState.tsx": "Generic empty-state component showing an illustration or icon, descriptive text, and an optional action button.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users for their name and saving the profile with validation and toast feedback.",
  "frontend/src/components/ResponsiveTableShell.tsx": "Scrollable container component providing horizontal scroll for wide tables, especially on mobile.",
  "frontend/src/components/SyncStatusIndicator.tsx": "Indicator showing syncing, synced, or error states with icons and optional time-ago display.",
  "frontend/src/features/ledger/BackupRestorePanel.tsx": "UI panel that exports the current ledger state to a JSON file and restores from backup with confirmation when unsaved changes exist.",
  "frontend/src/features/ledger/CarExpensesPanel.tsx": "Interface for adding, viewing, and totaling car-related expenses with category selection, auto-toll settings, and date‑range filtering.",
  "frontend/src/features/ledger/CashPaymentForm.tsx": "Dialog form for recording cash payments for a traveller with amount, date, and optional note validation.",
  "frontend/src/features/ledger/ClearDataPanel.tsx": "Password‑protected panel that allows clearing various types of ledger data using confirmation dialogs.",
  "frontend/src/features/ledger/CoTravellerIncomeDialog.tsx": "Dialog for adding or editing other co‑traveller income entries with amount, date picker, notes, and state persistence.",
  "frontend/src/features/ledger/DailyParticipationGrid.tsx": "Renders a grid for marking daily morning/evening trips per traveller with bulk toggles, weekend rules, and save actions.",
  "frontend/src/features/ledger/DateRangePicker.tsx": "Provides a date range selector using popover calendars, supporting both controlled and context-driven updates.",
  "frontend/src/features/ledger/DeleteCarExpenseAlertDialog.tsx": "Confirmation dialog for deleting a car expense and showing a success toast.",
  "frontend/src/features/ledger/DeleteCashPaymentAlertDialog.tsx": "Confirmation dialog for deleting a traveller cash payment with success feedback.",
  "frontend/src/features/ledger/DeleteTripHistoryEntryAlertDialog.tsx": "Dialog to confirm deletion of a trip history entry, optionally noting removal of all participation for that date.",
  "frontend/src/features/ledger/EditCarExpenseDialog.tsx": "Form dialog for editing car expense fields with validation and update callbacks.",
  "frontend/src/features/ledger/EditCashPaymentDialog.tsx": "Form dialog to edit a cash payment’s amount, date, and note with validation and save handling.",
  "frontend/src/features/ledger/EditTripHistoryTravellerDialog.tsx": "Dialog for updating a traveller’s morning/evening trip participation for a specific date.",
  "frontend/src/features/ledger/ExpenseHistoryDialog.tsx": "Dialog wrapper displaying the expense history view for the selected date range.",
  "frontend/src/features/ledger/ExpenseHistoryView.tsx": "Displays, filters, searches, sorts, edits, and deletes car expense records using ledger state.",
  "frontend/src/features/ledger/ExportButton.tsx": "Shows an export button that opens the export report dialog.",
  "frontend/src/features/ledger/ExportReportDialog.tsx": "Provides a configurable dialog for exporting ledger reports with filters, formats, and date ranges.",
  "frontend/src/features/ledger/LedgerPage.tsx": "Main ledger UI containing tabs, dialogs, date‑range management, and state synchronization.",
  "frontend/src/features/ledger/LedgerStateContext.tsx": "Context provider exposing full ledger state and all mutation functions backed by local state hooks.",
  "frontend/src/features/ledger/MobileLedgerSidebarNav.tsx": "Mobile sidebar menu for navigating ledger tabs and opening history/export dialogs.",
  "frontend/src/features/ledger/MonthYearRangeSelector.tsx": "Selector component for choosing month or year ranges based on date‑range classification.",
  "frontend/src/features/ledger/OtherPendingAmountForm.tsx": "Dialog form to add a traveller’s other pending amount with validation and submission callbacks.",
  "frontend/src/features/ledger/OverallMonthYearSelector.tsx": "Empty file or placeholder with no implemented content.",
  "frontend/src/features/ledger/OverallSummaryPanel.tsx": "Computes and displays total income, expenses, and profit/loss plus monthly breakdown using daily data and car expenses.",
  "frontend/src/features/ledger/PaymentHistoryDialog.tsx": "Dialog wrapper showing payment history within the selected date range.",
  "frontend/src/features/ledger/PaymentHistoryView.tsx": "Displays filterable and editable cash payment records in a table with traveller filtering.",
  "frontend/src/features/ledger/PaymentSummaryPanel.tsx": "Generates per-traveller payment summaries including charges, payments, dues, and co‑traveller totals.",
  "frontend/src/features/ledger/RatePerTripControl.tsx": "Input control to view and update the global rate per trip with validation.",
  "frontend/src/features/ledger/SummaryPanel.tsx": "Shows per‑traveller trip counts, charges, payments, pending amounts, and balances for the selected range.",
  "frontend/src/features/ledger/TravellerManager.tsx": "UI for adding, editing, and removing travellers, including balance check before deletion.",
  "frontend/src/features/ledger/TripHistoryPanel.tsx": "Builds and displays a combined list of traveller trips and co-traveller incomes with editing and deletion dialogs.",
  "frontend/src/features/ledger/TripsPaymentYearSelector.tsx": "Empty file or placeholder with no implemented logic.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useAppDataSync.ts": "Handles periodic syncing of local ledger state with remote backend data, including merging and conflict resolution.",
  "frontend/src/hooks/useAutoTollSettings.ts": "Manages auto-toll settings in localStorage with persistence and simple update helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and stored identity restoration.",
  "frontend/src/hooks/useLedgerLocalState.ts": "Manages full local ledger state with persistence, including travellers, trips, payments, expenses, and settings.",
  "frontend/src/hooks/useQueries.ts": "Hooks for fetching and saving the caller's user profile using React Query and an actor client.",
  "frontend/src/index.css": "Tailwind base styles with custom CSS variables for light/dark themes and table readability enhancements.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the main App.",
  "frontend/src/utils/accountingStatements.ts": "Generates monthly, profit/loss, income, and expense reports from ledger data with date‑based aggregation.",
  "frontend/src/utils/backupRestore.ts": "Handles exporting, importing, validating, and merging ledger backup data as JSON files.",
  "frontend/src/utils/dateRange.ts": "Utilities for building and classifying date ranges and formatting or listing days within a range.",
  "frontend/src/utils/exportExcel.ts": "Builds CSV-formatted Excel exports including daily grids, trip totals, and summary calculations.",
  "frontend/src/utils/exportPdf.ts": "Generates various PDF reports by composing HTML from ledger data and selected report types.",
  "frontend/src/utils/exportReport.ts": "Generates CSV and PDF carpool ledger reports using filters, daily data, traveller info, and date range to produce grids and summaries.",
  "frontend/src/utils/ledgerBalances.ts": "Computes per‑traveller trip counts, charges, payments, and balances within a date range, including weekend and pending logic.",
  "frontend/src/utils/money.ts": "Provides INR currency formatting and parsing utilities.",
  "frontend/src/utils/tripCalculations.ts": "Calculates total and monthly income from recorded trip data and optional co‑traveller incomes, respecting weekend inclusion rules.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, and clearing URL and session parameters for routing and persistence.",
  "frontend/src/utils/weekendInclusion.ts": "Determines whether dates, especially weekends, should be included or editable based on settings and saved trip data.",
  "frontend/tailwind.config.js": "TailwindCSS configuration with custom colors, fonts, animations, and plugins.",
  "project_state.json": "Project state metadata describing features, issues, and versioning for the Carpool Ledger app."
}