{
  "kind": "build_request",
  "title": "Revamp Export Report page with improved traveller PDF table and standard financial statements (no DataSync impact)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Export Report UI (Export Report dialog/page) so the default export includes all travellers, while still supporting an explicit “Selected travellers only” mode.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user"
        ],
        "quotes": [
          "should it list all travellers by default",
          "Export report page"
        ]
      },
      "acceptanceCriteria": [
        "When the Export Report UI is opened, the traveller filter default is “All travellers”.",
        "If the user switches to “Selected travellers only”, exporting is blocked with a clear error message unless at least 1 traveller is selected.",
        "Exports (CSV/PDF/print) respect the traveller filter mode consistently across all traveller-dependent sections."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Revise the exported traveller summary table (PDF/print and CSV) to match the requested columns and wording: Traveller Name, Trip Count, Total Amount, Total Payment, Balance, State. Ensure the table is produced for all travellers by default.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user"
        ],
        "quotes": [
          "Traveller name, Trip Count, Total Amount, Total payment,Balance, State i want this kind of table for all user or selected user"
        ]
      },
      "acceptanceCriteria": [
        "PDF/print output contains a traveller summary table with column headers exactly: “Traveller Name”, “Trip Count”, “Total Amount”, “Total Payment”, “Balance”, “State”.",
        "CSV export contains the same column set and matches the calculated values used in the PDF/print export.",
        "“State” is a human-readable status derived from the balance (e.g., Due/Overpaid/Settled) and is present for every traveller row.",
        "The traveller summary table lists all travellers when traveller filter mode is “All travellers”."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add new report types to the Export Report page: Monthly Report, Profit & Loss Statement, Income Statement, and Expense Statement, generated using standard accounting-style structures based on existing ledger data (income from trips + co-traveller income; expenses from car expenses).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user"
        ],
        "quotes": [
          "Follow standards",
          "Also add option to print Monthly report, Profit Loss statement, Income Statement, Expense Staement"
        ]
      },
      "acceptanceCriteria": [
        "The Export Report UI offers selectable options for: Monthly Report, Profit & Loss Statement, Income Statement, Expense Statement.",
        "Each new report type can be exported as PDF/print from the Export Report page.",
        "Each statement uses consistent “standard” labeling and presentation (sections, totals, and net results where applicable) and is derived only from existing stored ledger fields (no new required user inputs).",
        "Monthly Report presents a month-by-month breakdown for the currently selected date range."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Implement PDF/print generation for the new report types with a clean, printable layout (A4), consistent typography, and page-break behavior suitable for long tables.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user"
        ],
        "quotes": [
          "Export PDF report not upto the mark",
          "add option to print Monthly report, Profit Loss statement, Income Statement, Expense Staement"
        ]
      },
      "acceptanceCriteria": [
        "Printing/exporting any of the new report types opens a print dialog (or equivalent PDF/print flow) and produces a readable A4 layout without overlapping text.",
        "Long tables do not break rows across pages; headings repeat or remain visually clear at page boundaries where applicable.",
        "All user-facing text in the generated report is in English."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Ensure all reporting changes do not impact the existing DataSync feature (sync polling/merge/save behavior and backend app-data persistence).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user"
        ],
        "quotes": [
          "please make sure data sync not impact",
          "Do not impact DataSync feature"
        ]
      },
      "acceptanceCriteria": [
        "No changes are made to the DataSync hook behavior (poll interval, debounce timing, merge-before-save logic) beyond any strictly necessary type wiring for new export options.",
        "Exporting/printing reports does not trigger additional saves, modify ledger state, or change sync status behavior.",
        "Existing sync continues to function across refresh/login/logout as before, and exporting reports does not introduce sync errors."
      ]
    }
  ],
  "constraints": [
    "Do not modify or weaken the existing DataSync behavior; reporting must be read-only with respect to ledger state.",
    "Frontend files under frontend/src/components/ui and other immutablePaths must not be edited directly; compose them instead.",
    "Keep backend as single-actor Motoko architecture; avoid schema/state migrations unless strictly required (not expected for reporting-only changes).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new backend storage fields or new accounting categories beyond what already exists in the ledger data.",
    "Integrating external PDF generation services or third-party reporting tools.",
    "Real-time collaboration or multi-user shared ledgers beyond the current per-user data model."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}