{
  "kind": "build_request",
  "title": "Add Backup & Restore tab to export/import all stored app data (JSON, merge restore)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a new Ledger page tab named \"Backup & Restore\" positioned immediately before the existing \"Clear Data\" tab in the tab bar, and render a new panel for this tab.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Just provide a machanism to Backup and restore all the data present\ncreate a tab before clear data",
          "Backup & Restore"
        ]
      },
      "acceptanceCriteria": [
        "Ledger page shows a new tab label \"Backup & Restore\" in the TabsList before the \"Clear Data\" tab.",
        "Selecting \"Backup & Restore\" displays a dedicated panel; existing tabs (Travellers/Daily/Summary/Car Expense/Overall/Clear Data) continue to work as before."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement \"Backup\" export that downloads a JSON file containing all stored app data, including (at minimum) the locally stored ledger state under the existing localStorage key \"carpool-ledger-state\" and the authenticated caller's user profile stored in the backend (if present).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "JSON file",
          "all stored data in the app"
        ]
      },
      "acceptanceCriteria": [
        "Backup panel includes a clear action (e.g., button) to download a .json file.",
        "The exported JSON includes the full ledger local state (travellers, dailyData, dateRange, ratePerTrip, cashPayments, otherPending, carExpenses, includeSaturday, includeSunday) sourced from the same data used by the app (localStorage key \"carpool-ledger-state\").",
        "The exported JSON includes the current caller user profile data returned by backend getCallerUserProfile (or null/omitted when no profile exists).",
        "Export works while authenticated; failures show an English error message/toast without crashing the app."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement \"Restore\" import that accepts a user-selected JSON file and restores data by merging it with existing stored data (do not clear existing data during restore).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "merge with existing data"
        ]
      },
      "acceptanceCriteria": [
        "Backup panel includes a file input (accepting .json) and a restore action.",
        "On selecting an invalid JSON file or invalid schema, the UI shows an English error message/toast and does not modify existing data.",
        "On successful restore, existing data remains present and backup data is merged in (no destructive overwrite/clear of collections).",
        "After restore, the UI updates immediately to reflect the merged state across all relevant screens/tabs without requiring a refresh."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Define and apply deterministic merge rules for restoring ledger local state so that repeated restores are idempotent and do not create duplicate records.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "merge with existing data",
          "all stored data in the app"
        ]
      },
      "acceptanceCriteria": [
        "Travellers: merge by traveller.id; if an id already exists locally, keep the local record; otherwise add the backup record.",
        "Cash payments / other pending / car expenses: merge by item.id using the same rule (keep local on id conflict; add missing).",
        "dailyData: merge by dateKey then travellerId; for conflicts, set each boolean (morning/evening) to true if either local or backup is true (logical OR).",
        "Settings fields (dateRange, ratePerTrip, includeSaturday, includeSunday): restore must not delete other data; if the restore applies these fields, their behavior must be documented in the UI (e.g., a short note in the panel describing whether settings will be taken from the backup or kept local).",
        "After merge, both saved dailyData and draftDailyData remain consistent (draft reflects the merged saved data unless the user currently has unsaved draft changes, in which case restore must require confirmation before applying)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "During restore, merge the caller user profile from the backup with the existing backend-stored profile using non-destructive behavior: do not clear an existing profile; only save the backup profile if the caller currently has no profile.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "all stored data in the app",
          "merge with existing data"
        ]
      },
      "acceptanceCriteria": [
        "If getCallerUserProfile returns null and the backup includes a profile object, the app saves it via saveCallerUserProfile.",
        "If getCallerUserProfile already returns a profile, restore does not overwrite it.",
        "Any backend error during profile restore is surfaced as an English error message/toast and does not prevent local ledger data restore from completing."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn UI sources). Compose existing UI components instead.",
    "Do not modify immutable frontend paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx)."
  ],
  "nonGoals": [
    "Adding third-party cloud backup providers (e.g., Google Drive/Dropbox).",
    "Implementing real-time sync or multi-device auto-sync.",
    "Implementing a full backend backup of unrelated canister state not used by the current UI flows."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}