{
  "kind": "build_request",
  "title": "Fix Daily Participation loading full month on initial load",
  "projectName": "Carpool Ledger",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the Daily Participation grid initially renders only the currently selected week date range (Mon–Fri) on app load, and does not briefly or persistently render the full current month unless the user explicitly changes the date range to a month.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "while loading app date range is showing of current week as expected but Daily Participation load for full month insted current week until any date change"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh page load, when the app’s visible date range is the current week, the Daily Participation grid shows rows only for that same week (Mon–Fri).",
        "The Daily Participation grid does not load/render a full-month range on initial load when the active tab is Daily and the date range selector is showing the current week.",
        "No user interaction (e.g., changing the date range) is required for the Daily Participation grid to match the initially displayed week date range."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure changing the date range immediately updates the Daily Participation grid to match the newly selected date range (including when switching between weeks).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Should changing the date range (week selector) immediately update the Daily Participation view to match?"
        ]
      },
      "acceptanceCriteria": [
        "When the user changes the date range using the date range picker, the Daily Participation grid updates its displayed rows to match the new start/end dates without requiring additional actions.",
        "Switching away from and back to the Daily tab preserves and restores that tab’s saved date range and the grid matches it."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose them only).",
    "Do not modify immutable hook files listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx)."
  ],
  "nonGoals": [
    "Do not change the default date range behavior for non-Daily tabs (they may remain month-based as currently implemented).",
    "Do not change backend data models or Motoko canister APIs for this fix."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}