{
  "kind": "build_request",
  "title": "Default full-year date range on Trips & Payment tabs with selectable year",
  "projectName": "Carpool Ledger",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Change the date-range behavior so that the \"Trips & Payment\" experience defaults to a full-year range (Jan 1 to Dec 31) for the current year, while still allowing users to manually change the start/end dates.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "For Trips & Payment page Date Range should be of entire year Jan 1st to 31st dec for better payment tracking",
          "1. just default to that while still allowing users to change it"
        ]
      },
      "acceptanceCriteria": [
        "When the user opens the Trips & Payment tab(s), the date range is automatically set to Jan 1 through Dec 31 of the current year (unless the user previously set a different date range for those tabs in this session).",
        "The existing date pickers remain usable so the user can manually set any start and end dates after the default is applied.",
        "User-facing text remains in English."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Apply the full-year default and year-selection behavior only to the Trips & Payment-related tabs (\"Trip History\" and \"Trips & Payment\"), and do not change the default date range behavior for other tabs (e.g., Daily, Summary, Expense, Overall).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "this apply to only Trips & payment tab"
        ]
      },
      "acceptanceCriteria": [
        "Entering the \"Trip History\" tab or the \"Trips & Payment\" tab triggers the full-year default behavior defined in REQ-1.",
        "Other tabs continue to use the existing default date range behavior (currently the current week Monday–Friday) when the app is first used.",
        "Switching between Trips & Payment tabs and other tabs does not permanently overwrite the other tabs’ preferred/last-used date range for the current session (i.e., the app remembers the last date range used in non-Trips/Payment tabs separately from the one used in Trips/Payment tabs)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a year selector for the Trips & Payment-related tabs that defaults to the current year; when the user selects a different year, automatically set the date range to the full-year range for that selected year (Jan 1–Dec 31).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Default is current but users be able to select a different year with the same full‑year range"
        ]
      },
      "acceptanceCriteria": [
        "On Trips & Payment-related tabs, the UI provides a year selection control (e.g., dropdown/select) that defaults to the current year.",
        "Changing the selected year immediately updates the date range to Jan 1–Dec 31 of the selected year.",
        "After selecting a year, the user can still manually adjust the start/end dates via the existing date picker controls.",
        "The year selector is not shown (or otherwise does not affect date range) on non-Trips/Payment tabs."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn UI components must be composed, not modified).",
    "Do not edit immutable frontend hook files listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx)."
  ],
  "nonGoals": [
    "Do not change backend data models or Motoko canister logic for this request.",
    "Do not change date range calculations used by exports/reports beyond what naturally follows from the selected date range on the relevant tabs."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}