{
  "kind": "build_request",
  "title": "Update Auto Toll to daily-only and add Trip History with date-range totals",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Change Auto Toll Add behavior so that when Auto Toll is enabled it auto-creates at most one Toll car-expense entry per day (weekdays only), instead of pre-filling Toll entries for every weekday in the currently selected date range/week.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "is this possible to auto add toll only on starting of the day instead adding for whole week ?",
          "Yes Please Update"
        ]
      },
      "acceptanceCriteria": [
        "With Auto Toll Add enabled, switching the ledger date range no longer bulk-creates Toll expenses for every weekday in the range.",
        "On a weekday, if there is no existing Toll expense entry for that date, the app auto-adds exactly one Toll expense for that date with the configured amount.",
        "If a Toll expense already exists for the current weekday date, no duplicate Toll entry is created.",
        "No Toll entries are auto-added for Saturday or Sunday.",
        "Auto-added Toll expenses remain visible in Car Expenses and are persisted in the same local ledger state as before."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a Trip History screen accessible from the in-app menu that uses the same global Date Range selection used across the ledger pages, and displays trip history rows with: Traveller name, Trip date, and Trip count per day; also include co-traveller income entries as single-trip records; and show total trip count at the bottom for the selected date range.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Also add a Trip History in Menu Where showing Name of Travellers with Date and Morning evening Trip date wise and Other Traveller if Added income for other traveller and add count as 1 trip",
          "1. Date Range exist same as all page \n2. Yes a single entry should consider as 1 trip \n3. Mark ther together as 2 Trip"
        ]
      },
      "acceptanceCriteria": [
        "A new Trip History entry is available in the ledger menu/navigation (including the mobile sidebar menu).",
        "Trip History uses the existing ledger dateRange state (the same DateRangePicker selection used elsewhere) and updates automatically when the date range changes.",
        "For each date within the selected date range, Trip History shows a row per traveller when they have any participation that day; trip count is 0–2 based on Morning (1) + Evening (1), so Morning+Evening together counts as 2 trips.",
        "Any single trip marking (only Morning or only Evening) is counted as 1 trip.",
        "Each co-traveller income record within the selected date range appears in Trip History as its own row with a trip count of 1.",
        "A “Total trips” value is displayed at the bottom of Trip History and equals the sum of all trip counts shown for the selected date range (including the co-traveller income rows counted as 1 each).",
        "All user-facing text on the new screen is in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not edit immutable hook files listed in SYSTEM_CONTEXT.frontend.immutablePaths.",
    "Keep all backend logic in the single Motoko actor if any backend change becomes necessary (none required by this request)."
  ],
  "nonGoals": [
    "Do not change how Summary, Overall, Export, or existing History dialogs calculate money amounts unless required to support the new Trip History view.",
    "Do not add new authentication methods beyond the existing Internet Identity flow.",
    "Do not introduce any external database or third-party APIs."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}