{
  "kind": "build_request",
  "title": "Fix ledger backup/export by persisting ledger state in canister and exporting full raw records",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement canister-backed persistence for the full LedgerState (travellers, daily participation history, dateRange, ratePerTrip, cashPayments, otherPending, carExpenses, includeSaturday/includeSunday) keyed to the authenticated caller, so data is not stored only in browser memory.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "Might be data is storing in browser memory i dont know you machanism",
          "it is not backing up data of Travellers, Daily Participation history, summary, car expense, overall summary"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes stable storage for ledger data per caller (Internet Identity principal).",
        "After refresh/sign-out/sign-in on the same identity, previously entered travellers, daily participation, payments, other pending, car expenses, and settings reload from the canister (not empty)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add backend methods for ledger backup/restore so the export contains the full raw records exactly as stored: loadLedgerState, saveLedgerState, exportLedgerData (returns LedgerState), restoreLedgerData (accepts LedgerState), and clearAllLedgerData (or equivalent) for the caller.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "yes backup file is created but no data in it attaching content of file",
          "2 - automatically"
        ]
      },
      "acceptanceCriteria": [
        "exportLedgerData returns non-empty arrays/objects when the caller has stored data (e.g., travellers.length > 0 after adding travellers).",
        "restoreLedgerData overwrites the caller’s stored ledger with the uploaded LedgerState and subsequent export returns the restored data.",
        "Backend enforces that callers can only load/save/export/restore/clear their own ledger data."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Wire the frontend ledger data layer to the backend by replacing the current placeholder implementations in frontend/src/hooks/useLedgerQueries.ts (which currently return null or an empty LedgerBackup) with real actor calls to the new backend methods.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "yes backup file is created but no data in it attaching content of file"
        ]
      },
      "acceptanceCriteria": [
        "useLoadLedgerState returns the caller’s persisted LedgerState from the canister (not always null).",
        "useSaveLedgerState persists changes to the canister (no longer just console logging).",
        "useExportLedgerBackup exports a JSON file whose data fields match the caller’s stored ledger and are not empty when data exists.",
        "useRestoreLedgerBackup sends the uploaded backup to the backend and refreshes the UI from canister data."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure all destructive 'Clear Data' actions clear canister-backed data as well (not only React local state), so exports after clearing do not include cleared records.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Might be data is storing in browser memory i dont know you machanism"
        ]
      },
      "acceptanceCriteria": [
        "After using 'Clear All Ledger Data', exporting a backup produces an empty/default LedgerState for the caller.",
        "After using each targeted clear option (daily participation only, cash payments only, other pending only, car expenses only), exporting a backup reflects only that dataset being cleared while other datasets remain intact."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit any files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding third-party storage, external databases, or cloud sync outside the canister.",
    "Changing the JSON backup file structure (keep LedgerBackup { version, exportedAt, data }).",
    "Adding new report/CSV export formats beyond fixing backup/export of raw records."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}