{
  "kind": "build_request",
  "title": "App-wide current-week (Mon–Fri) default date range + Auto Toll Add in Car Expense",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the app’s default date range selection so that on initial load it is always set to the current week from Monday through Friday (inclusive), matching the date-range UI shown in the provided screenshot. This default must apply everywhere in the app where a date range is displayed/used.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Date range default selection should be always current week Starting from Monday to Friday.",
          "Yes, everywhere a date range appears in the app"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh load, the Date Range control shows the current week’s Monday as start date and Friday as end date.",
        "The default is not the current month anymore.",
        "All screens/components that rely on the shared ledger dateRange reflect the Monday–Friday current-week default consistently."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add an \"Auto Toll Add\" toggle control inside the Car Expense menu/panel. When enabled, it turns on the automatic toll creation behavior described in REQ-4; when disabled, no automatic toll entries are created.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add a button Auto Toll Add in Car Expense menue which allowed to on and off Auto Add facility of Toll"
        ]
      },
      "acceptanceCriteria": [
        "The Car Expense panel includes a clearly labeled \"Auto Toll Add\" toggle.",
        "The toggle state is persisted locally so it remains the same after a page reload."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a toll amount input beside the \"Auto Toll Add\" toggle in the Car Expense menu/panel. The amount input must be editable only when Auto Toll is OFF; when Auto Toll is ON, the input becomes read-only and the auto-added toll expense amount uses this value.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "also add a input beside radio for adding amount for toll and its allow add amount when radio is of once radio is on it read only",
          "Yes amount in amount input"
        ]
      },
      "acceptanceCriteria": [
        "When Auto Toll is OFF, the toll amount input can be edited.",
        "When Auto Toll is ON, the toll amount input is read-only/disabled but still displays the configured amount.",
        "The amount value is persisted locally and survives page reloads."
      ]
    },
    {
      "id": "REQ-4",
      "text": "When \"Auto Toll Add\" is ON, automatically add a Toll car expense entry for each weekday (Monday–Friday) using the configured toll amount. The system must avoid creating duplicate auto-added toll entries for the same date.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "while on it automatically add Toll default expense daily for that day",
          "add Toll Expense every day automatically for week days."
        ]
      },
      "acceptanceCriteria": [
        "Enabling Auto Toll results in Toll expense entries being created for applicable weekdays without requiring manual form submission.",
        "Each auto-created toll expense uses the configured toll amount from the amount input.",
        "No duplicate auto-added toll entry is created for the same date if the user revisits/reloads the app or toggles Auto Toll on multiple times.",
        "Auto Toll does not create entries for Saturday or Sunday."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only UI components); compose existing components instead.",
    "Do not edit any paths listed in frontend.immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend must remain single-actor; only introduce backend changes if strictly required by the requested functionality."
  ],
  "nonGoals": [
    "Implementing true background/cron scheduling while the app is closed (auto-add can occur when the app runs/loads).",
    "Adding third-party integrations or notifications for auto-added tolls.",
    "Changing existing backend schema or adding new canisters/services solely for Auto Toll behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}