{
  "kind": "build_request",
  "title": "Fix black screen on app load and add safe runtime fallback UI",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-7",
      "text": "Diagnose and fix the root cause of the deployed app rendering a black screen so that the initial UI reliably renders (at minimum: the unauthenticated login screen from AuthGate).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "I am unable to view any content only black screen"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh load (no cached data) the app renders visible UI instead of a blank/black screen.",
        "If the user is not authenticated, the AuthGate login card is visible and clickable.",
        "If the user is authenticated, the app proceeds to profile lookup and renders either ProfileSetupModal or LedgerPage.",
        "No uncaught runtime exceptions occur during initial render (verify in browser console)."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add a top-level runtime error boundary and a user-facing fallback screen that appears if any render-time error occurs, showing an English error message and a 'Reload' action, and logging the underlying error details to the browser console.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "I am unable to view any content only black screen"
        ]
      },
      "acceptanceCriteria": [
        "If a component throws during render/effects, the app shows a fallback view (not a blank screen) with clear English copy (e.g., 'Something went wrong.').",
        "Fallback view includes a button that reloads the page.",
        "The thrown error and component stack (when available) are logged to console for debugging.",
        "Normal operation is unaffected when no error occurs."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Ensure the frontend config module required by the auth/actor hooks (imported as '../config') is present and cannot crash the app at runtime: it must provide safe defaults and handle missing/invalid environment/config values gracefully (e.g., Internet Identity URL, derivation origin, canister/agent config).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "I am unable to view any content only black screen"
        ]
      },
      "acceptanceCriteria": [
        "The app does not crash on startup even when optional config values are missing.",
        "If Internet Identity provider URL is not configured, the login flow still has a valid provider URL (via a safe default) or shows a clear on-screen configuration error instead of a blank screen.",
        "Any config-loading failures are surfaced via the error boundary fallback (or an explicit in-app error state), not as a black screen."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Add an explicit, visible loading state for app initialization phases that can otherwise appear blank (e.g., while InternetIdentityProvider initializes and while the caller profile query is waiting on actor availability).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "I am unable to view any content only black screen"
        ]
      },
      "acceptanceCriteria": [
        "During initialization (before AuthGate can decide what to render), the user sees a loading screen/skeleton instead of a blank view.",
        "Loading text is in English and does not mention internal implementation details.",
        "Once initialization completes, the app transitions to the correct UI (login/profile setup/ledger)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, or frontend/src/hooks/useActor.ts (immutable paths). Implement fixes by adding/adjusting other modules/components they depend on, or by adding new wrapper components at the app level.",
    "Keep the backend as a single Motoko actor (no additional backend services)."
  ],
  "nonGoals": [
    "Adding new ledger features unrelated to fixing the black screen.",
    "Changing authentication provider away from Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}