{
  "kind": "build_request",
  "title": "Add per-traveller cash payments and apply them to pending balance in Summary + Export",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-15",
      "text": "Add a per-traveller \"cash payment\" entry in the ledger UI and automatically apply it to reduce that traveller’s pending balance (within the currently selected date range).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "also inclide Traveller pay amount in cash adjust them with pending amount for respective user"
        ]
      },
      "acceptanceCriteria": [
        "In the Summary view, each traveller shows non-zero Payments when cash payments have been recorded for that traveller within the selected date range.",
        "Balance in Summary is recalculated as: (tripCount × ratePerTrip) − payments (and continues to update immediately when AM/PM checkboxes are toggled or ratePerTrip changes).",
        "A user can record a cash payment for a specific traveller (at minimum: amount; date defaults to today; optional note if already supported elsewhere).",
        "After recording a cash payment, the traveller’s pending Balance decreases immediately without page refresh.",
        "Cash payment input validates numeric amount > 0 and shows user-facing validation text in English when invalid."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Persist recorded per-traveller cash payments in localStorage alongside the existing ledger local state so that payments and balances remain after reload.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "also inclide Traveller pay amount in cash adjust them with pending amount for respective user"
        ]
      },
      "acceptanceCriteria": [
        "After adding cash payments and reloading the page, Summary still shows the same Payments and Balance totals for the same date range.",
        "Removing a traveller removes (or safely ignores) any stored payments associated with that traveller to prevent orphaned data errors.",
        "If a new localStorage key is introduced for cash payments, the app handles missing/old data safely (no runtime errors on load)."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Update the CSV export Summary section to include the recorded per-traveller cash payments and the resulting balance for the selected date range (instead of exporting Payments as 0).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "also inclide Traveller pay amount in cash adjust them with pending amount for respective user"
        ]
      },
      "acceptanceCriteria": [
        "Exported CSV “Summary” rows show Payments equal to the sum of recorded cash payments for that traveller within the selected date range.",
        "Exported CSV “Summary” Balance equals Total Charge − Payments for each traveller.",
        "Daily Grid export remains unchanged except for any necessary recalculation consistency (no regressions in AM/PM export columns)."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui must not be edited (compose instead).",
    "Keep the backend as a single Motoko actor; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Implementing third-party payments or online payment gateways.",
    "Adding real-time sync across devices/users for cash payments (this request is for in-app entry and calculation).",
    "Changing the existing AM/PM trip marking behavior or weekend disabling rules."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}