{
  "kind": "build_request",
  "title": "Fix auto-toll to add once per weekday and enable multi-category expense entry",
  "projectName": "Carpool Ledger",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Modify the auto-toll feature to check if a toll expense already exists for the current date when the app launches. If no toll exists and it is a weekday (Monday-Friday), automatically add one toll expense entry. Ensure toll is only added once per day regardless of how many times the app is opened.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Auto add toll only add a toll once in a day during weekdays when app is launched",
          "if auto toll is already added for that date it will not add auto toll again"
        ]
      },
      "acceptanceCriteria": [
        "On app launch, the system checks if today is a weekday",
        "On app launch, the system checks if a toll expense already exists for today's date",
        "If both conditions are met (weekday and no existing toll), one toll expense is automatically added",
        "If a toll already exists for today, no additional toll is added",
        "The auto-toll feature works independently of the traveller checkbox"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add functionality to the add expense popup to create 3 expense entries simultaneously with categories pre-selected as 'Toll', 'CNG BRD', and 'CNG AHM'. Each entry should allow the user to input amount and date independently.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "i want to add 3 expenses at a time for add expense popup when Category should be Toll, CNG BRD, CNG AHM should be auto selected for category"
        ]
      },
      "acceptanceCriteria": [
        "The add expense popup displays 3 separate expense entry forms",
        "The first form has category pre-selected as 'Toll'",
        "The second form has category pre-selected as 'CNG BRD'",
        "The third form has category pre-selected as 'CNG AHM'",
        "Each form allows independent input of amount and date",
        "All 3 expenses are created when the user submits the form"
      ]
    }
  ],
  "constraints": [
    "Do not modify the backend schema or main.mo",
    "Preserve existing auto-toll settings functionality in useAutoTollSettings.ts",
    "Maintain the current expense tracking structure in the ledger state"
  ],
  "nonGoals": [
    "Relating auto-toll to the traveller checkbox or participation tracking",
    "Modifying the single expense entry workflow",
    "Changing the expense category list or validation rules"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}