{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore sync polling behavior, improve responsive navigation, and enable PDF/Excel exports",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a Log out action to the mobile hamburger/sidebar menu with the same logout behavior as the existing header logout.",
      "acceptanceCriteria": [
        "On small screens, the hamburger/sidebar menu includes a clearly labeled \"Log out\" item.",
        "Clicking \"Log out\" clears the Internet Identity session, clears React Query cache, and removes local storage key \"carpool-ledger-state\" (same behavior as existing header logout).",
        "After logout, the app returns to the unauthenticated/login state and no user data remains visible."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/ledger/MobileLedgerSidebarNav.tsx",
          "operation": "modify",
          "description": "Add a new \"Log out\" menu item to the mobile sidebar action list and accept an onLogout callback prop to execute the logout flow from the menu."
        },
        {
          "path": "frontend/src/features/ledger/LedgerPage.tsx",
          "operation": "modify",
          "description": "Wire the new MobileLedgerSidebarNav onLogout handler to the existing logout behavior (Internet Identity clear, React Query cache clear, remove localStorage key \"carpool-ledger-state\") and ensure the sidebar closes after logout."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Restore multi-device sync behavior by hardening polling/merge and preventing echo saves so updates propagate cross-device within ~2–5 seconds while authenticated.",
      "acceptanceCriteria": [
        "When logged in as the same Internet Identity on Device A and Device B, edits to any ledger data on Device A (e.g., travellers, daily participation, payments, car expenses, other pending, co-traveller income, rate per trip, date-range-related state if persisted) are visible on Device B within 2–5 seconds without a manual refresh.",
        "Edits made concurrently on both devices do not cause data loss; the final state is a merged result consistent with the existing merge strategy (non-destructive merge).",
        "Sync status indicator updates to show syncing/synced/failed appropriately, and failures do not permanently stop future sync attempts while authenticated.",
        "Logging out stops polling/sync activity and resets sync state to idle."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAppDataSync.ts",
          "operation": "modify",
          "description": "Adjust polling/merge logic to more reliably detect remote changes (prefer timestamp-based detection), reduce unnecessary sync churn, and prevent echo saves after applying remote merges so cross-device updates converge within the target 2–5 seconds."
        },
        {
          "path": "frontend/src/components/SyncStatusIndicator.tsx",
          "operation": "modify",
          "description": "Ensure sync status UI covers syncing/synced/failed states clearly and can reflect the restored behavior (including after retries) without getting stuck; keep accessibility attributes consistent."
        },
        {
          "path": "frontend/src/components/AppHeader.tsx",
          "operation": "modify",
          "description": "Ensure logout behavior continues to stop sync activity (via identity clearing), clears cached data, and removes \"carpool-ledger-state\"; keep it consistent with the mobile menu logout flow."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Make the Date Range controls responsive on small screens and prevent layout collisions with the hamburger/menu button.",
      "acceptanceCriteria": [
        "On small screens, the Date Range label and the start/end date buttons wrap or stack cleanly without overlapping the page title/hamburger button.",
        "Both date buttons remain fully visible and clickable at common narrow widths (e.g., ~320px).",
        "On larger screens, Date Range layout remains aligned and consistent with existing design."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/ledger/LedgerPage.tsx",
          "operation": "modify",
          "description": "Update the top header layout to stack/wrap appropriately on narrow widths so the hamburger/title block and the DateRangePicker do not overlap (e.g., use responsive flex direction and spacing)."
        },
        {
          "path": "frontend/src/features/ledger/DateRangePicker.tsx",
          "operation": "modify",
          "description": "Improve small-screen layout by allowing the date button row to wrap (or stack) and ensuring buttons can shrink without overflowing while staying fully clickable."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Show Payment History, Expense History, and Export Report as visible desktop navigation actions while keeping them in the mobile hamburger menu.",
      "acceptanceCriteria": [
        "At laptop/desktop widths (i.e., where the desktop tab bar is shown), the UI includes visible, clickable navigation items labeled \"Payment History\", \"Expense History\", and \"Export Report\".",
        "Clicking each item on desktop opens the same dialogs/views as the mobile menu actions.",
        "At small/mobile widths, these items remain accessible from the hamburger/sidebar menu."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/ledger/LedgerPage.tsx",
          "operation": "modify",
          "description": "Add a desktop-visible action group (shown alongside the existing lg tab bar UI) for Payment History, Expense History, and Export Report, wired to open the same dialogs currently opened by mobile sidebar actions."
        },
        {
          "path": "frontend/src/features/ledger/MobileLedgerSidebarNav.tsx",
          "operation": "modify",
          "description": "Keep the existing mobile action items for Payment History, Expense History, and Export Report and ensure behavior matches the new desktop actions."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Enable functional PDF and Excel export options in Export Report with clear success/failure feedback.",
      "acceptanceCriteria": [
        "In the Export Report dialog, selecting PDF or Excel no longer shows \"Not Available\" messaging and does not disable the export action purely due to format choice.",
        "Excel export produces a downloadable file (at minimum a .csv-compatible export is acceptable if generated by the existing Excel export utility) and completes successfully for typical ledger sizes.",
        "PDF export triggers a functional PDF workflow without external services (e.g., a printable report view using the browser print-to-PDF flow) and provides a clear instruction or automatic print dialog.",
        "Success and error toasts accurately reflect the outcome for CSV, Excel, and PDF exports."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/ledger/ExportReportDialog.tsx",
          "operation": "modify",
          "description": "Remove \"Not Available\" UI/disable logic for PDF/Excel, wire Excel to the existing exportToExcel utility, and wire PDF to a print-to-PDF workflow; update toast messages to reflect success/failure per format."
        },
        {
          "path": "frontend/src/utils/exportExcel.ts",
          "operation": "modify",
          "description": "Ensure the Excel export utility can be invoked reliably from the Export Report dialog for typical ledger sizes (CSV-compatible output acceptable) and supports the dialog’s filtered traveller selection where feasible."
        },
        {
          "path": "frontend/src/utils/exportPdf.ts",
          "operation": "create",
          "description": "Implement a client-side, no-external-service printable report workflow (render/compose a printable view from the current ledger state + selected sections/travellers, open print dialog, and surface clear instructions/errors) to support browser print-to-PDF."
        }
      ]
    }
  ]
}