{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Daily-only Auto Toll Add + Trip History with date-range totals",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update Auto Toll so enabling it only auto-creates a single Toll expense for the current weekday (never bulk-create across the selected date range).",
      "acceptanceCriteria": [
        "With Auto Toll Add enabled, switching the ledger date range no longer bulk-creates Toll expenses for every weekday in the range.",
        "On a weekday, if there is no existing Toll expense entry for that date, the app auto-adds exactly one Toll expense for that date with the configured amount.",
        "If a Toll expense already exists for the current weekday date, no duplicate Toll entry is created.",
        "No Toll entries are auto-added for Saturday or Sunday.",
        "Auto-added Toll expenses remain visible in Car Expenses and are persisted in the same local ledger state as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/ledger/CarExpensesPanel.tsx",
          "operation": "modify",
          "description": "Replace the current dateRange-driven weekday loop with a daily-only Auto Toll effect: when Auto Toll is enabled, check only today's date; if today is Mon–Fri and there is not already a Toll expense for today's date, auto-add exactly one Toll expense with the configured amount. Ensure the effect does not create duplicates on re-render and does not react to dateRange changes."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a Trip History screen in the ledger menu that uses the shared date range and shows per-day trip counts per traveller plus co-traveller income rows, with a total trips footer.",
      "acceptanceCriteria": [
        "A new Trip History entry is available in the ledger menu/navigation (including the mobile sidebar menu).",
        "Trip History uses the existing ledger dateRange state (the same DateRangePicker selection used elsewhere) and updates automatically when the date range changes.",
        "For each date within the selected date range, Trip History shows a row per traveller when they have any participation that day; trip count is 0–2 based on Morning (1) + Evening (1), so Morning+Evening together counts as 2 trips.",
        "Any single trip marking (only Morning or only Evening) is counted as 1 trip.",
        "Each co-traveller income record within the selected date range appears in Trip History as its own row with a trip count of 1.",
        "A “Total trips” value is displayed at the bottom of Trip History and equals the sum of all trip counts shown for the selected date range (including the co-traveller income rows counted as 1 each).",
        "All user-facing text on the new screen is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/ledger/TripHistoryPanel.tsx",
          "operation": "create",
          "description": "Implement the Trip History screen UI as a new ledger panel: read shared ledger state (dateRange, dailyData, travellers, coTravellerIncomes) and render a responsive table/list with rows containing Traveller name, Trip date, and Trip count per day (0–2 from morning+evening). Include additional rows for each co-traveller income record in range (trip count = 1). Show a bottom summary row/section with “Total trips” equal to the sum of all displayed trip counts. Keep all labels and text in English."
        },
        {
          "path": "frontend/src/features/ledger/LedgerPage.tsx",
          "operation": "modify",
          "description": "Wire Trip History into the main ledger navigation: add a new tab (e.g., value \"trip-history\") that renders TripHistoryPanel, update the desktop TabsList layout to include the new tab, and ensure it uses the existing DateRangePicker state (no new date-range state)."
        },
        {
          "path": "frontend/src/features/ledger/MobileLedgerSidebarNav.tsx",
          "operation": "modify",
          "description": "Add a \"Trip History\" item to the mobile sidebar menu that selects the new Trip History tab, ensuring it appears alongside other ledger menu items and closes the sidebar on selection."
        }
      ]
    }
  ]
}