{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Stabilize initial render, add runtime error fallback, and harden auth/actor config",
  "requirements": [
    {
      "id": "REQ-7",
      "summary": "Fix the initial black screen by preventing startup-time crashes and ensuring AuthGate (or a visible init state) always renders on first load.",
      "acceptanceCriteria": [
        "On a fresh load (no cached data) the app renders visible UI instead of a blank/black screen.",
        "If the user is not authenticated, the AuthGate login card is visible and clickable.",
        "If the user is authenticated, the app proceeds to profile lookup and renders either ProfileSetupModal or LedgerPage.",
        "No uncaught runtime exceptions occur during initial render (verify in browser console)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the root UI always renders something visible during startup: integrate an explicit initialization/loading view while authenticated profile lookup is in progress; avoid returning empty content in any initial state; keep existing AuthGate flow intact so the unauthenticated login card is the minimum visible UI."
        },
        {
          "path": "frontend/src/components/AuthGate.tsx",
          "operation": "modify",
          "description": "Make AuthGate resilient and always visible: add handling for Internet Identity initialization and missing Internet Identity provider configuration (show a clear on-screen configuration error instead of attempting login). Use shadcn-ui Card/Button styling already present; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/InitLoadingScreen.tsx",
          "operation": "create",
          "description": "Add a simple, user-facing initialization/loading screen used during auth/provider initialization and during authenticated bootstrapping phases, so no phase appears blank. Use shadcn-ui Card/Skeleton/Button as appropriate; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Add a top-level error boundary with a user-facing fallback screen that logs errors and offers a reload action.",
      "acceptanceCriteria": [
        "If a component throws during render/effects, the app shows a fallback view (not a blank screen) with clear English copy (e.g., 'Something went wrong.').",
        "Fallback view includes a button that reloads the page.",
        "The thrown error and component stack (when available) are logged to console for debugging.",
        "Normal operation is unaffected when no error occurs."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RuntimeErrorBoundary.tsx",
          "operation": "create",
          "description": "Implement a top-level React error boundary that catches render-time errors, logs error details (including component stack when available) to the browser console, and renders a fallback UI with English copy and a Reload action. Use shadcn-ui components for consistent UI; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/RuntimeErrorFallback.tsx",
          "operation": "create",
          "description": "Create the fallback screen UI used by the error boundary: clear English message ('Something went wrong.'), optional short guidance, and a Reload button that triggers a full page reload. Use shadcn-ui Button/Card (and optionally EmptyState) for layout; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Wrap the app providers/root (<QueryClientProvider>, <InternetIdentityProvider>, <App>) with the new RuntimeErrorBoundary so any startup/render error shows the fallback instead of a black screen."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Provide a safe frontend config module (imported as '../config') with defaults and guardrails so auth/actor hooks cannot crash the app when config/env values are missing or invalid.",
      "acceptanceCriteria": [
        "The app does not crash on startup even when optional config values are missing.",
        "If Internet Identity provider URL is not configured, the login flow still has a valid provider URL (via a safe default) or shows a clear on-screen configuration error instead of a blank screen.",
        "Any config-loading failures are surfaced via the error boundary fallback (or an explicit in-app error state), not as a black screen."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config.ts",
          "operation": "create",
          "description": "Create the missing '../config' module exporting loadConfig() and createActorWithConfig() with safe defaults and defensive validation. Ensure loadConfig never crashes the app on missing/invalid values (return defaults or throw a clear Error that will be caught by the runtime error boundary). Ensure createActorWithConfig safely constructs an actor configuration for authenticated/anonymous usage and surfaces misconfiguration as a user-visible error via the boundary rather than a silent blank screen."
        },
        {
          "path": "frontend/src/components/AuthGate.tsx",
          "operation": "modify",
          "description": "Add an explicit configuration guard for the Internet Identity provider URL used by the login flow: if the provider URL is missing/invalid, render a clear in-app configuration error state (English copy) rather than calling login and risking a blank screen. Use shadcn-ui Card/Button for the error state; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Add explicit, visible loading states for initialization phases (InternetIdentityProvider init and actor/profile query gating) that otherwise look blank.",
      "acceptanceCriteria": [
        "During initialization (before AuthGate can decide what to render), the user sees a loading screen/skeleton instead of a blank view.",
        "Loading text is in English and does not mention internal implementation details.",
        "Once initialization completes, the app transitions to the correct UI (login/profile setup/ledger)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AuthGate.tsx",
          "operation": "modify",
          "description": "Use InternetIdentityProvider state (e.g., isInitializing/loginStatus) to render InitLoadingScreen while the auth client initializes, instead of rendering nothing/blank. Keep the existing unauthenticated login card as the next state. Use shadcn-ui components; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add an authenticated initialization state: while actor/profile lookup is pending (e.g., useGetCallerUserProfile isLoading and identity exists), render InitLoadingScreen (or an inline loading section) so the UI never appears blank before showing ProfileSetupModal or LedgerPage."
        },
        {
          "path": "frontend/src/components/InitLoadingScreen.tsx",
          "operation": "modify",
          "description": "Refine the loading screen copy and presentation to be clear English, generic (no internal implementation details), and reusable for both auth initialization and post-login bootstrapping. Use shadcn-ui components; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}