{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Current work-week default date range + Auto Toll Add in Car Expense",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Change the shared ledger dateRange default to always initialize as the current week Monday–Friday across the app (replacing current-month default).",
      "acceptanceCriteria": [
        "On a fresh load, the Date Range control shows the current week’s Monday as start date and Friday as end date.",
        "The default is not the current month anymore.",
        "All screens/components that rely on the shared ledger dateRange reflect the Monday–Friday current-week default consistently."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/dateRange.ts",
          "operation": "modify",
          "description": "Add a utility to compute the current week (Mon–Fri) DateRange and any small helpers needed to reuse this default consistently throughout the frontend."
        },
        {
          "path": "frontend/src/hooks/useLedgerLocalState.ts",
          "operation": "modify",
          "description": "Update the ledger state initialization logic so the default dateRange on app load is always the current week Monday–Friday (inclusive), and ensure the same default is applied wherever the dateRange is initialized/reset (e.g., first run and clear/reset flows)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add an \"Auto Toll Add\" toggle in the Car Expense panel and persist its state locally across reloads.",
      "acceptanceCriteria": [
        "The Car Expense panel includes a clearly labeled \"Auto Toll Add\" toggle.",
        "The toggle state is persisted locally so it remains the same after a page reload."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAutoTollSettings.ts",
          "operation": "create",
          "description": "Create a small hook to load/save the Auto Toll enabled setting to localStorage (including safe parsing and a stable storage key)."
        },
        {
          "path": "frontend/src/features/ledger/CarExpensesPanel.tsx",
          "operation": "modify",
          "description": "Add a clearly labeled \"Auto Toll Add\" toggle control within the Car Expense UI and wire it to the persisted setting from useAutoTollSettings (compose existing UI components; do not edit files under frontend/src/components/ui). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a persisted toll amount input beside the Auto Toll Add toggle; editable only when Auto Toll is OFF and read-only when ON.",
      "acceptanceCriteria": [
        "When Auto Toll is OFF, the toll amount input can be edited.",
        "When Auto Toll is ON, the toll amount input is read-only/disabled but still displays the configured amount.",
        "The amount value is persisted locally and survives page reloads."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAutoTollSettings.ts",
          "operation": "modify",
          "description": "Extend the Auto Toll settings hook to also persist a tollAmount value to localStorage, including defaults and validation/coercion for numeric input."
        },
        {
          "path": "frontend/src/features/ledger/CarExpensesPanel.tsx",
          "operation": "modify",
          "description": "Place a toll amount input beside the \"Auto Toll Add\" toggle; disable/read-only the input when Auto Toll is ON and allow editing only when OFF, while always showing the persisted configured amount. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "When Auto Toll Add is enabled, auto-create one Toll car expense per weekday (Mon–Fri) using the configured amount, without duplicates for the same date.",
      "acceptanceCriteria": [
        "Enabling Auto Toll results in Toll expense entries being created for applicable weekdays without requiring manual form submission.",
        "Each auto-created toll expense uses the configured toll amount from the amount input.",
        "No duplicate auto-added toll entry is created for the same date if the user revisits/reloads the app or toggles Auto Toll on multiple times.",
        "Auto Toll does not create entries for Saturday or Sunday."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/dateRange.ts",
          "operation": "modify",
          "description": "Add helper(s) to enumerate weekdays (Mon–Fri) within a given DateRange (using existing date key formatting) to support deterministic auto-creation checks."
        },
        {
          "path": "frontend/src/features/ledger/CarExpensesPanel.tsx",
          "operation": "modify",
          "description": "Implement Auto Toll behavior: when enabled, compute applicable weekdays (Mon–Fri) (e.g., within the currently selected dateRange), create missing Toll car expense entries using the configured amount, and prevent duplicates by checking existing carExpenses for the same date before adding. Ensure this runs on enable and on app reload while the app is open. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}