{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Full-year default date range and year selector for Trips & Payment tabs",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Default Trips & Payment-related tabs to the full current year date range while keeping existing date pickers editable.",
      "acceptanceCriteria": [
        "When the user opens the Trips & Payment tab(s), the date range is automatically set to Jan 1 through Dec 31 of the current year (unless the user previously set a different date range for those tabs in this session).",
        "The existing date pickers remain usable so the user can manually set any start and end dates after the default is applied.",
        "User-facing text remains in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/dateRange.ts",
          "operation": "modify",
          "description": "Add a utility to compute a full-year date range (Jan 1–Dec 31) for a given year to support Trips & Payment defaults without altering existing current-week utilities."
        },
        {
          "path": "frontend/src/features/ledger/DateRangePicker.tsx",
          "operation": "modify",
          "description": "Update DateRangePicker to support controlled usage via optional props (current range + onChange) while preserving its existing context-backed behavior, so Trips & Payment tabs can apply a different default without breaking other tabs."
        },
        {
          "path": "frontend/src/features/ledger/LedgerPage.tsx",
          "operation": "modify",
          "description": "Implement session-scoped date-range handling in the ledger page so that entering Trip History or Trips & Payment sets the date range to the current year's full-year range only if the user has not already adjusted the Trips/Payment date range in this session, and keep the existing date pickers functional for manual edits."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Scope full-year default behavior to Trip History and Trips & Payment only, preserving other tabs' existing date-range behavior and separate session memory.",
      "acceptanceCriteria": [
        "Entering the \"Trip History\" tab or the \"Trips & Payment\" tab triggers the full-year default behavior defined in REQ-1.",
        "Other tabs continue to use the existing default date range behavior (currently the current week Monday–Friday) when the app is first used.",
        "Switching between Trips & Payment tabs and other tabs does not permanently overwrite the other tabs’ preferred/last-used date range for the current session (i.e., the app remembers the last date range used in non-Trips/Payment tabs separately from the one used in Trips/Payment tabs)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/ledger/LedgerPage.tsx",
          "operation": "modify",
          "description": "Introduce separate in-session date-range state buckets for (a) Trips/Payment tabs (Trip History + Trips & Payment) and (b) all other tabs; when switching tabs, restore the appropriate bucket into the shared ledger dateRange so non-Trips tabs keep their last-used range (e.g., current week by default) independently from Trips/Payment."
        },
        {
          "path": "frontend/src/features/ledger/DateRangePicker.tsx",
          "operation": "modify",
          "description": "Ensure DateRangePicker change events can be routed through LedgerPage so manual edits update the correct session bucket (Trips/Payment vs other tabs) without changing date behavior elsewhere."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a year selector on Trip History and Trips & Payment that defaults to the current year and sets the range to the selected year's full year.",
      "acceptanceCriteria": [
        "On Trips & Payment-related tabs, the UI provides a year selection control (e.g., dropdown/select) that defaults to the current year.",
        "Changing the selected year immediately updates the date range to Jan 1–Dec 31 of the selected year.",
        "After selecting a year, the user can still manually adjust the start/end dates via the existing date picker controls.",
        "The year selector is not shown (or otherwise does not affect date range) on non-Trips/Payment tabs."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/ledger/TripsPaymentYearSelector.tsx",
          "operation": "create",
          "description": "Create a small, reusable year-selection UI component (e.g., select/dropdown) that defaults to the current year and exposes an onChange(year) callback for the Trips & Payment tabs."
        },
        {
          "path": "frontend/src/features/ledger/LedgerPage.tsx",
          "operation": "modify",
          "description": "Wire TripsPaymentYearSelector into the LedgerPage toolbar area and render it only when the active tab is Trip History or Trips & Payment; on selection change, set the Trips/Payment session bucket date range to the selected year's full-year range and update the shared ledger dateRange accordingly."
        },
        {
          "path": "frontend/src/utils/dateRange.ts",
          "operation": "modify",
          "description": "Use the full-year range utility (added/updated here) as the single source of truth when applying a selected year so the date range is always Jan 1–Dec 31 for that year."
        }
      ]
    }
  ]
}