{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Carpool Ledger — Default to current month + synced Month/Year selectors on Overall tab",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Default non–Trips & Payment tabs to the current calendar month on fresh load and after clear-all reset, while keeping Trips & Payment full-year default behavior.",
      "acceptanceCriteria": [
        "On a fresh load with no prior saved local state, the date range defaults to the current month (start = first day of month, end = last day of month).",
        "Using \"Clear Data\" / clear-all behavior resets the date range to the current month (not the current week).",
        "Existing behavior for Trips & Payment tabs (Trip History and Payment tabs) continues to default to a full-year range when first entering those tabs, unless explicitly changed by the user."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/dateRange.ts",
          "operation": "modify",
          "description": "Add utilities to compute the current calendar month range (first day through last day) and a general full-month range helper for a given month/year."
        },
        {
          "path": "frontend/src/hooks/useLedgerLocalState.ts",
          "operation": "modify",
          "description": "Change the local-state default date range (including the no-localStorage fallback and clear-all reset) to use the current calendar month utilities instead of the current week Monday–Friday."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add Month and Year dropdown selectors on the Overall tab that instantly update the shared date range and keep the DateRangePicker display in sync.",
      "acceptanceCriteria": [
        "When viewing the Overall tab, Month and Year dropdowns are visible near the date range controls.",
        "Selecting a Month immediately updates the date range to that month’s full span.",
        "Selecting a Year immediately updates the date range (full year if no month selected; otherwise the selected month within that year).",
        "Selecting Month/Year updates the existing DateRangePicker start/end displays accordingly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/ledger/OverallMonthYearSelector.tsx",
          "operation": "create",
          "description": "Create an Overall-tab-only Month/Year selector component that uses shadcn-ui Select primitives to drive the shared dateRange in LedgerStateContext. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/ledger/LedgerPage.tsx",
          "operation": "modify",
          "description": "Wire the new OverallMonthYearSelector into the existing date controls row so it appears only when the Overall tab is active and updates the same shared date range as DateRangePicker. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Synchronize Overall Month/Year dropdowns with manual DateRangePicker edits, showing matching month/year when exact, otherwise a clear Custom state.",
      "acceptanceCriteria": [
        "Changing start/end dates via the DateRangePicker updates the Year dropdown to the year of the selected range when determinable.",
        "If the selected range exactly matches a full calendar month (first to last day within the same month/year), the Month dropdown updates to that month.",
        "If the selected range exactly matches a full calendar year (Jan 1–Dec 31), the Month dropdown switches to a non-month state (e.g., \"All\" or empty) and the Year dropdown reflects that year.",
        "If the selected range spans multiple months or does not align to full-month/full-year boundaries, the Month dropdown shows \"Custom\" (and Year shows \"Custom\" only if the range spans multiple years)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/dateRange.ts",
          "operation": "modify",
          "description": "Add helper(s) to classify a date range as an exact full-month, exact full-year, or custom (including multi-year detection) to support consistent dropdown synchronization behavior."
        },
        {
          "path": "frontend/src/features/ledger/OverallMonthYearSelector.tsx",
          "operation": "modify",
          "description": "Implement derived selector state from the shared dateRange so manual DateRangePicker changes update Month/Year selectors (month match, year match, or Custom/All states) without creating update loops. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}