{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Persisted ledger backup/export: wire frontend ledger queries to canister-backed storage and clear actions",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Replace placeholder ledger query/mutation hooks with real backend actor calls for load/save/export/restore and ensure UI refreshes from canister state.",
      "acceptanceCriteria": [
        "useLoadLedgerState returns the caller’s persisted LedgerState from the canister (not always null).",
        "useSaveLedgerState persists changes to the canister (no longer just console logging).",
        "useExportLedgerBackup exports a JSON file whose data fields match the caller’s stored ledger and are not empty when data exists.",
        "useRestoreLedgerBackup sends the uploaded backup to the backend and refreshes the UI from canister data."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Extend the typed backendInterface to include the new ledger-related backend capabilities (loadLedgerState, saveLedgerState, exportLedgerData, restoreLedgerData, clearAllLedgerData and any additional clear variants required by the UI) so frontend actor calls compile cleanly."
        },
        {
          "path": "frontend/src/hooks/useLedgerQueries.ts",
          "operation": "modify",
          "description": "Implement useLoadLedgerState/useSaveLedgerState/useExportLedgerBackup/useRestoreLedgerBackup using real actor calls (no placeholder null/empty backups), keep the existing LedgerBackup JSON structure { version, exportedAt, data }, and ensure React Query invalidation keeps the UI synced after mutations."
        },
        {
          "path": "frontend/src/hooks/useLedgerLocalState.ts",
          "operation": "modify",
          "description": "Ensure local ledger state initialization and refresh flow correctly reflects canister-backed data by leveraging the updated query hooks; keep refreshFromCanister behavior aligned with query invalidation so restore/load updates are reflected after sign-in and after restore."
        },
        {
          "path": "frontend/src/features/ledger/SettingsPanel.tsx",
          "operation": "modify",
          "description": "Ensure backup export/restore flows rely on the updated query hooks: export should download the full raw records returned by the backend, and restore should trigger a canister refresh (invalidate ledger queries and call refreshFromCanister) so the UI reflects restored data immediately."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update all 'Clear Data' actions so they clear canister-backed ledger data (not only local React state) and exports reflect cleared datasets.",
      "acceptanceCriteria": [
        "After using 'Clear All Ledger Data', exporting a backup produces an empty/default LedgerState for the caller.",
        "After using each targeted clear option (daily participation only, cash payments only, other pending only, car expenses only), exporting a backup reflects only that dataset being cleared while other datasets remain intact."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Add/align typed declarations for any targeted clear backend capabilities used by the UI (daily participation only, cash payments only, other pending only, car expenses only), ensuring the frontend can call these functions without type errors."
        },
        {
          "path": "frontend/src/hooks/useLedgerQueries.ts",
          "operation": "modify",
          "description": "Add/implement React Query mutations for destructive clear actions (clearAll and targeted clears) using actor calls, and invalidate the ledgerState query on success so subsequent exports/loads reflect cleared canister data."
        },
        {
          "path": "frontend/src/hooks/useLedgerLocalState.ts",
          "operation": "modify",
          "description": "Update the clearAllLedgerData/clearDailyData/clearCashPayments/clearOtherPending/clearCarExpenses actions to call the corresponding canister-backed clear mutations first (or in tandem), then update local state and trigger a refresh from canister so the UI and exports remain consistent."
        },
        {
          "path": "frontend/src/features/ledger/ClearDataPanel.tsx",
          "operation": "modify",
          "description": "Wire Clear Data UI actions to the updated canister-clearing ledger state actions (instead of only clearing local state) and keep existing confirmation/toast UX in English while ensuring exports after clearing match the canister state."
        }
      ]
    }
  ]
}