{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Daily Participation initial load date range mismatch (week vs month)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Prevent Daily Participation from rendering a full-month range on initial load when the active date range is the current week (Mon–Fri).",
      "acceptanceCriteria": [
        "On a fresh page load, when the app’s visible date range is the current week, the Daily Participation grid shows rows only for that same week (Mon–Fri).",
        "The Daily Participation grid does not load/render a full-month range on initial load when the active tab is Daily and the date range selector is showing the current week.",
        "No user interaction (e.g., changing the date range) is required for the Daily Participation grid to match the initially displayed week date range."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/ledger/LedgerPage.tsx",
          "operation": "modify",
          "description": "Eliminate the initial month-based render by initializing the Daily tab’s date range to the current week (Mon–Fri) synchronously (e.g., via lazy initialization and/or useLayoutEffect), and initialize tabDateRanges with Daily=week and other tabs=month without a first-render month fallback."
        },
        {
          "path": "frontend/src/hooks/useLedgerLocalState.ts",
          "operation": "modify",
          "description": "Stop the persisted/localStorage-loaded dateRange from overriding the UI-selected initial Daily week range on mount (e.g., do not apply stored dateRange during initial load, or gate it so LedgerPage-controlled initialization wins), while keeping non-Daily tabs month-based via LedgerPage’s per-tab date range behavior."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure changing the date range immediately updates the Daily Participation grid and that tab switching restores the saved range correctly.",
      "acceptanceCriteria": [
        "When the user changes the date range using the date range picker, the Daily Participation grid updates its displayed rows to match the new start/end dates without requiring additional actions.",
        "Switching away from and back to the Daily tab preserves and restores that tab’s saved date range and the grid matches it."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/ledger/DailyParticipationGrid.tsx",
          "operation": "modify",
          "description": "Add an optional controlled dateRange prop for rendering (while still using LedgerStateContext for data/actions), and compute displayed days from the controlled range when provided to guarantee the grid always matches the currently selected range immediately."
        },
        {
          "path": "frontend/src/features/ledger/LedgerPage.tsx",
          "operation": "modify",
          "description": "Wire the DailyParticipationGrid to the LedgerPage-controlled date range (pass currentDateRange into the grid) so date picker changes and per-tab restored ranges immediately reflect in the grid without relying on timing of context updates."
        }
      ]
    }
  ]
}