{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Build an app feature set including Auto Toll behavior change (create toll entry daily at day start instead of pre-filling the week) and a new Trip History menu screen that lists trips by traveller/date with trip counts and totals over a selectable date range.",
  "architectural_notes": [
    "Trip History uses the same date range selector behavior as other pages.",
    "Trip counting rules: morning+evening marked together counts as 2 trips; any single entry (including 'Other Traveller income') counts as 1 trip."
  ],
  "known_issues": [],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-change-auto-toll-add-behavior-so-that-when-auto-toll-is-enabled-it-auto-creates-at-most-one-toll-car-expense-entry-per-day-weekdays-only-instead-of-pre-filling-toll-entries-for-every-weekday-in-the-currently-selected-date-range-week",
      "title": "Change Auto Toll Add behavior so that when Auto Toll is enabled it auto-creates at most one Toll car-expense entry per day (weekdays only), instead of pre-filling Toll entries for every weekday in the currently selected date range/week.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-add-a-trip-history-screen-accessible-from-the-in-app-menu-that-uses-the-same-global-date-range-selection-used-across-the-ledger-pages-and-displays-trip-history-rows-with-traveller-name-trip-date-and-trip-count-per-day-also-include-co-traveller-income-entries-as-single-trip-records-and-show-total-trip-count-at-the-bottom-for-the-selected-date-range",
      "title": "Add a Trip History screen accessible from the in-app menu that uses the same global Date Range selection used across the ledger pages, and displays trip history rows with: Traveller name, Trip date, and Trip count per day; also include co-traveller income entries as single-trip records; and show total trip count at the bottom for the selected date range.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Update Auto Toll to add a single toll entry at the start of each day (Mon–Fri) instead of pre-filling toll entries for the entire week.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Add Trip History screen in Menu showing traveller name, trip date, and trip count (morning+evening together counts as 2; single entry including 'Other Traveller income' counts as 1) and show total trips at bottom for selected date range.",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "projectName": "Update Auto Toll to daily-only and add Trip History with date-range totals",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}