{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "New project",
  "architectural_notes": [
    "Ensure all app data (Travellers, Daily Participation, summaries/overall summary, Car Expenses, etc.) is persisted in the canister (not only frontend/browser state).",
    "Backup/export should read from canister storage and export full raw records automatically (no user selection)."
  ],
  "known_issues": [
    "Backup file is generated but exported data arrays/records are empty (e.g., travellers=[], carExpenses=[]), suggesting backup is not reading persisted data (possibly data only in browser memory)."
  ],
  "isFixRequest": true,
  "existing_features": [],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Fix backup/export so it includes all Travellers, Daily Participation history, summaries (including overall), and Car Expenses by exporting full raw records automatically (currently file is created but data is empty).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Implement canister-backed persistence for the full LedgerState (travellers, daily participation history, dateRange, ratePerTrip, cashPayments, otherPending, carExpenses, includeSaturday/includeSunday) keyed to the authenticated caller, so data is not stored only in browser memory.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Add backend methods for ledger backup/restore so the export contains the full raw records exactly as stored: loadLedgerState, saveLedgerState, exportLedgerData (returns LedgerState), restoreLedgerData (accepts LedgerState), and clearAllLedgerData (or equivalent) for the caller.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Wire the frontend ledger data layer to the backend by replacing the current placeholder implementations in frontend/src/hooks/useLedgerQueries.ts (which currently return null or an empty LedgerBackup) with real actor calls to the new backend methods.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Ensure all destructive 'Clear Data' actions clear canister-backed data as well (not only React local state), so exports after clearing do not include cleared records.",
      "reqIds": [
        "REQ-4"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Fix ledger backup/export by persisting ledger state in canister and exporting full raw records",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}