{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-15T14:51:15.374Z",
  "summary": "Frontend changes add traveller filter mode defaulting to “all”, update CSV traveller summary headers, and introduce new report types with accounting statement data generation and PDF routing. However, the diff also introduces backend migration/schema changes (traveller.name -> traveller.pseudo) that were not requested and may violate the reporting-only/no-DataSync-impact constraints. Evidence for the exact PDF traveller table headers and the actual PDF implementations/layout for the new report types is not present in the provided truncated diff.",
  "missing_requirements": [
    {
      "id": "REQ-2",
      "requirement": "PDF/print output contains a traveller summary table with column headers exactly: “Traveller Name”, “Trip Count”, “Total Amount”, “Total Payment”, “Balance”, “State” (and produced for all travellers by default).",
      "reason": "CSV export clearly shows the updated headers, but the provided exportPdf.ts excerpt does not include the traveller summary table rendering or its exact column header text, so implementation cannot be verified from the diff summary.",
      "evidence": [
        "frontend/src/utils/exportReport.ts",
        "frontend/src/utils/exportPdf.ts"
      ]
    },
    {
      "id": "REQ-3",
      "requirement": "Export Report UI offers selectable options for Monthly Report, Profit & Loss Statement, Income Statement, and Expense Statement; each can be exported as PDF/print from the Export Report page.",
      "reason": "ReportType union includes the new types and exportPdf routes based on filters.reportType, but the UI portion showing the selectable options (e.g., SelectItems/labels) is not present in the truncated ExportReportDialog.tsx excerpt, so the actual UI options cannot be confirmed.",
      "evidence": [
        "frontend/src/features/ledger/ExportReportDialog.tsx",
        "frontend/src/utils/exportPdf.ts"
      ]
    },
    {
      "id": "REQ-4",
      "requirement": "Implement PDF/print generation for the new report types with clean A4 printable layout and page-break behavior suitable for long tables (no row splits; clear headings at page boundaries).",
      "reason": "exportPdf.ts routes to generateMonthlyReportPDF / generateProfitLossPDF / generateIncomeStatementPDF / generateExpenseStatementPDF, but the implementations of those functions (and their layout/page-break handling) are not shown in the diff excerpt, so compliance can’t be verified.",
      "evidence": [
        "frontend/src/utils/exportPdf.ts"
      ]
    },
    {
      "id": "REQ-5",
      "requirement": "Reporting changes do not impact existing DataSync behavior; reporting is read-only with respect to ledger state; avoid schema/state migrations for reporting-only changes.",
      "reason": "The diff introduces a backend migration and changes the Traveller type from {name} to {pseudo}, which is a schema/state migration and may affect persistence and sync behavior. This conflicts with the reporting-only/no-DataSync-impact constraint unless explicitly required (BuildRequest says not expected).",
      "evidence": [
        "backend/migration.mo",
        "backend/main.mo"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Backend schema/state migration changing travellers from having a `name` field to a `pseudo` field, including a migration runner wired into the main actor.",
      "reason": "BuildRequest is frontend/reporting focused and explicitly notes avoiding schema/state migrations unless strictly required (not expected for reporting-only changes). This backend change is not requested by any REQ and risks impacting app-data persistence/DataSync.",
      "evidence": [
        "backend/migration.mo",
        "backend/main.mo"
      ]
    }
  ],
  "confidence": 0.72,
  "changed_files": [
    "backend/main.mo",
    "backend/migration.mo",
    "frontend-file-summaries.txt",
    "frontend/src/features/ledger/ExportReportDialog.tsx",
    "frontend/src/utils/accountingStatements.ts",
    "frontend/src/utils/exportPdf.ts",
    "frontend/src/utils/exportReport.ts",
    "project_state.json"
  ]
}